import { province } from 'src/app/province/province_th';
import { sub } from './TH_sub';
import { TErrorMessageMapping } from 'src/app/auth/models/auth-model';
import { TFirebaseAuth } from 'src/app/firebase-auth/models/firebase-auth-model';
const { inputPoint, currency, usagePriceOnLandingPage } = sub;

const PersonalForm = {
  page1: {
    header: 'ร่วมทำแบบสอบถามประเมินการใช้งาน',
    ask: 'ไม่แสดงหน้านี้อีก',
    button: 'ร่วมทำแบบสอบถาม !',
  },
  page2: {
    header: 'รายละเอียดข้อมูลส่วนตัว',
    fullname: 'ชื่อจริง',
    age: 'อายุ',
    gender: 'เพศ',
    gender_array: ['ชาย', 'หญิง', 'ไม่ระบุ'],
    province: 'จังหวัดที่อยู่อาศัย',
    province_placeholder: 'เลือกจังหวัด',
    province_array: province.province_th,
  },
  textContents: [
    {
      title: 'คุณประกอบอาชีพอะไร?',
      choice: {
        image: ['teacher', 'building', 'briefcase', 'colorfilter', 'category'],
        text: [
          'นักเรียน/นักศึกษา',
          'พนักงานบริษัท',
          'ข้าราชการ',
          'Freelance',
          'อื่นๆ',
        ],
      },
      page: 3,
    },
    {
      title: 'ใช้ Botnoi voice เพื่อไปทำอะไร?',
      choice: {
        image: [
          'video-play',
          'teacher',
          'book',
          'subtitle',
          'device-message',
          'category',
        ],
        text: [
          'สร้างคอนเท้นต์ลงช่องตัวเอง',
          'นำไปสร้างสื่อการสอน',
          'อ่านหนังสือเสียง',
          'ทำ Presentation',
          'ทำสื่อโฆษณา หรือนำไปใช้ประชาสัมพันธ์',
          'อื่นๆ',
        ],
      },
      page: 4,
    },
    {
      title: 'รู้จัก Botnoi Voice จากช่องทางไหน?',
      choice: {
        image: ['magicpen', 'user-octagon', 'facebook', 'camera', 'youtube'],
        text: [
          'Tiktok Botnoivoice',
          'Tiktok จาก Creator คนอื่นๆ',
          'Facebook',
          'Instagram',
          'Youtube',
        ],
      },
      page: 5,
    },
  ],
  page6: [
    {
      title: 'การใช้งานโดยรวมเป็นอย่างไร?',
      difficult1: 'ควรปรับปรุง',
      difficult2: 'ดีมาก',
      placeholder: 'อธิบายเพิ่มเติม',
    },
    {
      title: 'ความง่ายต่อการใช้งานเป็นอย่างไร?',
      difficult1: 'ยากมาก',
      difficult2: 'ง่ายมาก',
      placeholder: 'อธิบายเพิ่มเติม',
    },
  ],
  page7: [
    {
      title: 'ตอบโจทย์การใช้งานมาก-น้อยแค่ไหน?',
      difficult1: 'น้อยที่สุด',
      difficult2: 'มากที่สุด',
      placeholder: 'อธิบายเพิ่มเติม',
    },
  ],
  page8: {
    title1: 'จะแนะนำให้เพื่อนใช้หรือไม่?',
    image: ['like', 'dislike'],
    choice: ['แนะนำ', 'ไม่แนะนำ'],
    title2:
      'เพื่อให้การใช้งานของคุณง่ายมากขึ้น อยากให้ Botnoi voice ปรับปรุงส่วนไหน',
    placeholder: 'พิมพ์ข้อความ',
  },
  page9: {
    title:
      'ยินดีให้เราติดต่อกลับเพื่อโอกาส ในการเป็นพาทเนอร์ร่วมกันในอนาคตหรือไม่?',
    image: ['agree', 'disagree'],
    choice: ['ยินดีให้ติดต่อกลับ', 'ไม่ยินดี'],
  },
  page10: {
    title: 'ขอบคุณสำหรับการร่วมทำแบบสอบถาม',
    sub: 'กดปุ่มด้านล่างเพื่อรับพอยท์',
    button: 'รับ',
    point: 'พอยท์',
  },
};

const Navbar = [
  {
    logout: 'ออกจากระบบ',
    login: 'เข้าสู่ระบบ',
    try_free: 'ลองใช้ฟรี',
    point: 'พอยท์',
    tutorial: 'แนะนำการใช้งาน',
    navbar_item: [
      'สตูดิโอ',
      'เสียงพากย์',
      'การนำไปใช้',
      'API',
      'ราคา',
      'Voice Bot',
    ],
    studioMenuItem: ['วิดีโอการใช้งาน', 'คู่มือการใช้งาน'],
    menu_navbar: [
      [
        'บัญชีของฉัน',
        'แพ็คเกจของฉัน',
        'พื้นที่เก็บไฟล์เสียง',
        'อัดเสียงแลกพ้อยท์',
        'เชิญเพื่อนได้พ้อยท์',
        'ใช้โค้ด',
        'เซลล์แดชบอร์ด',
      ],
      ['แจ้งปัญหาการใช้งาน', 'ลบบัญชี'],
    ],
  },
];

const LandingPage = [
  {
    carousel: {
      header: {
        h1: 'Botnoi Voice',
        h2: 'เสียงสังเคราะห์ AI พัฒนาโดยคนไทย',
        btn_and_input: {
          ex_sound: 'ฟังเสียงตัวอย่าง',
          intro_clip: 'คลิปแนะนำตัว',
          text_placeholder: 'ทดลองใช้งาน',
        },
      },
      footer: {
        text: 'สร้างสรรค์ผลงานของคุณให้น่าสนใจ',
        button: 'สตูดิโอสร้างเสียง',
      },
      personlist: [
        {
          id: '5',
          img: 'Alan-png',
          greeting: 'สวัสดีครับ, ',
          presentname: 'ผมอลัน',
          description: 'เสียงพากย์ผู้ชายเหมาะสำหรับเล่าเรื่องและอ่านข่าว',
          exam_sound:
            'https://dauk9xw0949zx.cloudfront.net/picture/alan/sound_1_alan.wav',
          url: 'https://youtu.be/mRo9DB0k7II',
        },
        {
          id: '1',
          img: 'Ava-png-resize',
          greeting: 'สวัสดีค่ะ, ',
          presentname: 'ฉันเอวา',
          description: 'เสียงพากย์ผู้หญิงเหมาะสำหรับเล่าเรื่องและอ่านข่าว',
          exam_sound:
            'https://dauk9xw0949zx.cloudfront.net/picture/ava/sound_1_ava.wav',
          url: 'https://www.youtube.com/watch?v=qeUnVl0t53k&t',
        },
        {
          id: '2',
          img: 'Bow-png-resize',
          greeting: 'สวัสดีค่ะ, ',
          presentname: 'หนูชื่อน้องโบ',
          description: 'เสียงพากย์เด็กผู้หญิงเหมาะสำหรับเล่าเรื่องและตัวละคร',
          exam_sound:
            'https://dauk9xw0949zx.cloudfront.net/picture/bow/sound_1_bow.wav',
          url: 'https://www.youtube.com/watch?v=w0DC3Wx2Y4A',
        },
      ],
    },
    point_content: {
      ...usagePriceOnLandingPage,
    },
    creative_work: {
      news_and_video: {
        header_1: 'ข่าวสารและวิดีโอแนะนำ',
        header_2: 'ทำให้รู้จักเรามากขึ้น',
      },
      menu_jump: {
        news: 'ข่าวสาร',
        ex_sound: 'ฟังตัวอย่างเสียง',
        incentive: 'ประโยชน์สำหรับคุณ',
        handbook: 'ขั้นตอนการใช้งาน',
        review: 'รีวิวผู้ใช้งานจริง',
        video_player: 'ตัวอย่างการใช้งาน',
        customer: 'ลูกค้าของเรา',
        contact_us: 'ช่องทางการติดต่อ',
      },
      nameMenu: [
        'ข่าวสาร',
        'ฟังตัวอย่างเสียง',
        'ประโยชน์สำหรับคุณ',
        'ขั้นตอนการใช้งาน',
        'รีวิวผู้ใช้งานจริง',
        'ตัวอย่างการใช้งาน',
        'ลูกค้าของเรา',
        'ช่องทางการติดต่อ',
      ],
    },
    sound_sample: {
      heading_text_h2_1: 'ให้',
      heading_text_p: 'Botnoi Voice',
      heading_text_h2_2: 'ช่วยคุณสร้างคอนเทนต์',
      subheading_text_h2_1: 'ด้วยเสียงพากย์คุณภาพ',
      subheading_text_p: 'หลากหลายภาษา',
      text_text_1: 'รวมเสียงพากย์',
      text_text_2: 'ไทย-อังกฤษ',
      text_text_3: 'และ',
      text_text_4: 'ภาษาเพื่อนบ้าน',
      text_text_5: 'อีกมากมาย',
      text_text_6: 'ให้เลือกใช้รวมกันมากถึง 8 ภาษา',
      text_text_7: '(จีน ญี่ปุ่น เวียดนาม ลาว เมียนมาร์ อินโดนีเซีย ฯลฯ)',
      text_btn: 'ทดลองใช้ตอนนี้',
      maleSpeker_List: [
        'อลัน',
        'อาวอร์ม',
        'คริส',
        'สโม๊ค',
        'นายเบรด',
        'ผู้ใหญ่ลี',
        'เท็ดดี้',
      ],
      femaleSpeaker_List: [
        'เอวา',
        'โบ',
        'ไซเรน',
        'นาเดียร์',
        'วนิลา',
        'อาจารย์หลิน',
        'ข้าวตอก',
      ],
      allSpeaker_List: [
        'อลัน',
        'อาวอร์ม',
        'คริส',
        'สโม๊ค',
        'นายเบรด',
        'ผู้ใหญ่ลี',
        'เท็ดดี้',
        'เอวา',
        'โบ',
        'ไซเรน',
        'นาเดียร์',
        'วนิลา',
        'อาจารย์หลิน',
        'ข้าวตอก',
      ],
      anotherVoiceover: 'ดูเสียงพากย์อื่นๆ เพิ่มเติม',

      categories: 'หมวดหมู่เสียง',
      lists: 'เสียงพากย์',
      text: 'ประโยคที่',
      imgNames: [
        'ยอดนิยม',
        'การบรรยาย',
        'พากย์ละคร',
        'พากย์การ์ตูน/อนิเมะ',
        'สำเนียงอื่นๆ',
        'ทั่วไป',
        'อ่านข่าว',
      ],
      tagNames: {
        NewsStyle: 'สไตล์อ่านข่าว',
        StorytellingStyle: 'สไตล์เล่าเรื่อง',
        AdvertiseSpotStyle: 'สไตล์สปอตโฆษณา',
        DocumentaraStyle: 'สไตล์สารคดี',
        DescribeStyle: 'สไตล์บรรยาย',
        FableStyle: 'สไตล์เล่านิทาน',
        TeacherStyle: 'สไตล์อาจารย์',
        CharacterStyle: 'สไตล์ตัวละคร',
        AnimeStyle: 'สไตล์อนิเมะ',
        LocalStyle: 'สไตล์ท้องถิ่น',
        ForeignVoiceStyle: 'สไตล์เสียงต่างประเทศ',
      },
    },
    studio: {
      heading: {
        text_1: 'ให้การสร้างสรรค์ของคุณต่อเนื่องขึ้นด้วย',
        text_highlight: 'สตูดิโอ',
      },
    },
    use_work: {
      text1_creative_work: {
        text_left: 'นี่คือสิ่งที่',
        text_center_1: 'Voiceover',
        text_center_2: 'ที่ดี',
        text_right: 'จะช่วยคุณ ..',
      },
      text_grid_item: [
        {
          p: 'ช่วยให้คุณ ..',
          h3: 'เป็นมืออาชีพมากขึ้น',
          text_on_pc: {
            h4_t1: 'ยกระดับผลงานของคุณให้ดูเป็นมืออาชีพ ทันสมัย',
            h4_t2: 'และน่าสนใจมากขึ้น',
          },
          text_on_mobile:
            'ยกระดับผลงานของคุณให้ดูเป็นมืออาชีพ ทันสมัย และน่าสนใจมากขึ้น',
        },
        {
          p: 'ช่วยให้คุณ ..',
          h3: 'ประหยัดเงินและเวลา',
          text_on_pc: {
            h4_t1: 'คุณจะสามารถสร้างเสียง Voiceover คุณภาพสูงได้ในราคาถูก',
            h4_t2: 'และใช้เวลาไม่นาน สะดวก ง่าย เข้าใจได้อย่างรวดเร็ว',
          },
          text_on_mobile:
            'คุณจะสามารถสร้างเสียง Voiceover คุณภาพสูงได้ในราคาถูก และใช้เวลาไม่นานสะดวก ง่าย เข้าใจได้อย่างรวดเร็ว',
        },
        {
          p: 'ช่วยให้คุณ ..',
          h3: 'มียอดไลค์ แชร์ และผู้ติดตามเพิ่มขึ้น',
          text_on_pc: {
            h4_t1:
              'ทำให้ Content ของคุณน่าสนใจและดึงดูดผู้ชม รวมไปถึงคุณจะได้รับ',
            h4_t2: 'ทั้งจำนวนการดูและจำนวนผู้ติดตามเพิ่มขึ้นอีกด้วย',
          },
          text_on_mobile:
            'ทำให้ Content ดูน่าสนใจและดึงดูดผู้ชม รวมไปถึงคุณจะได้รับทั้งจำนวนการดูและผู้ติดตามเพิ่มขึ้นด้วย',
        },
        {
          p: 'ช่วยให้คุณ ..',
          h3: 'มีอิสระในการทำงาน',
          text_on_pc: {
            h4_t1: 'ไม่ว่าจะเป็นการแก้ไขและปรับแต่งข้อความเสียงได้อย่างเต็มที่',
            h4_t2: 'ตามความต้องการของคุณ',
          },
          text_on_mobile:
            'ไม่ว่าจะเป็นการแก้ไขและปรับแต่งข้อความเสียงได้อย่างเต็มที่ตามความต้องการของคุณ',
        },
      ],
    },
    four_step: {
      topic_1: 'ทำได้ไม่ยาก สะดวก ใช้งานง่ายและประหยัดเวลา',
      topic_2: 'ให้คุณมีเวลาคิด Content เจ๋งๆ',
      title: 'ง่ายๆ แค่ 3 ขั้นตอน',
      step: [
        {
          title: 'STEP 1',
          description: 'พิมพ์หรือวางข้อความที่ต้องการ',
        },
        {
          title: 'STEP 2',
          description: 'คลุมข้อความเพื่อสร้างเสียง',
        },
        {
          title: 'STEP 3',
          description: 'ตั้งค่าเสียงจาก Pop - up Function',
        },
        {
          title: 'STEP 4',
          description: 'ดาวน์โหลดไฟล์เสียงนำไปใช้งาน',
        },
      ],
    },
    feedback: {
      title_1: 'Feedback',
      title_2: 'จากผู้ใช้งานจริง',
      title_3: 'คุณภาพดีไว้วางใจได้',
      feedback_item: [
        // can chang item detail on this
        {
          name: 'อนุพงศ์ อวชัย',
          position: 'CTO ของบริษัท เอ เอ็น ซี โบรกเกอร์เรจ จำกัด',
          description:
            'ครั้งแรกที่ ดร.วิน ส่งลิ้งค์ Youtube สอนทำ Chatbot EP.1 ให้ลองฟัง ผมก็เข้าไปฟังจนจบ ตอนแรกก็ไม่ได้เอะใจอะไร จนกระทั่ง ดร.วินบอกว่า เสียงที่ใช้พากย์ เป็นเสียงสังเคราะห์นะ ไม่ใช่เสียงคนจริงๆ ผมนี่รีบกลับไปฟังอีกรอบ แล้วบอก ดร.วินไปว่า ถ้าไม่บอกผมก็จับไม่ได้จริงๆ เสียงเหมือนคนมาก',
          image: '../../../assets/images/feedback/feedback1.webp',
        },
        {
          name: 'สิทธิโชค จิตต์ประสงค์',
          position: 'ผู้จัดการแผนกสารสนเทศ',
          company: 'บมจ. พีรพัฒน์ เทคโนโลยี',
          description:
            'เป็นระบบที่สังเคราะห์เสียงภาษาไทยได้ใกล้เคียงเสียงคนมากจริงๆ นอกจากนั้นยังทั้งวิธีการพูด การใช้เสียงค่อนข้างเป็นธรรมชาติ แบบเข้าใจภาษาไทย จึงทำให้สามารถใช้ลงเสียงในงานนำเสนอง่ายๆ ได้อย่างดี',
          image: '../../../assets/images/feedback/feedback2.webp',
        },
        {
          name: 'Toy Kasidis',
          position: 'Data Analyst เจ้าของเพจ DataRockie',
          description:
            'ผลงาน AI เสียงสังเคราะห์จากคนไทยพูดได้เป็นธรรมชาติมาก นำไปใช้กับงาน Customer service ได้หลายรูปแบบเลยครับ',
          image: '../../../assets/images/feedback/feedback3.webp',
        },
        {
          name: 'โยโย่',
          position: 'ทำงานด้านบรรยายและเขียนคอนเทนต์ด้านสุขภาพ',
          description:
            'ใช้งานง่าย เหมาะสำหรับผู้ที่มีปัญหาสภาพแวดล้อมมีเสียงรบกวน แม้ข้างบ้านจะทุบตึก เจาะปูนอยู่เสียงบรรยายของท่านก็จะไม่มีปัญหา เพราะมีเทคโนโลยีของบอทน้อยมาช่วย อยากทำเสียงประกอบการบรรยายแบบไหน เวลาไหนก็ได้ ไม่ต้องมานั่งกังวลอีกต่อไป',
          image: '../../../assets/images/feedback/feedback4.webp',
        },
      ],
    },
    apply_work: {
      title_1: 'นำไปใช้งานได้หลากหลาย',
      title_2: 'ใช้งานได้กับทุกรูปแบบ',
      item_contain: [
        {
          src: 'https://www.youtube.com/embed/IG-IU25OZ2A',
          title: 'YouTube video player',
          description: 'บอทน้อยเล่าผี',
        },
        {
          src: 'https://www.youtube.com/embed/uJp_D0-DD7A',
          title: 'YouTube video player',
          description: 'บอทน้อยอ่านข่าว',
        },
        {
          src: 'https://www.youtube.com/embed/g5m6zmeYo8M',
          title: 'YouTube video player',
          description: 'บอทน้อยสอนทำแชทบอท',
        },
      ],
    },
    patform_customers: {
      headtext: 'ลูกค้าที่ใช้แพลตฟอร์มของเรา',
      subtext: 'รับรองจากหลายๆองค์กร',
    },
    aboutus: {
      left: {
        topic: 'ช่องทางการติดต่อ',
        title: 'ปรึกษาและสนใจสร้างเสียง AI',
        informations: {
          local: 'ที่อยู่บริษัท',
          email: 'อีเมลติดต่อ',
          phone: 'ติดต่อฝ่ายขาย',
          website: 'เว็บไซต์',
          social: 'โซเชียลมีเดีย',
        },
      },
      right: {
        input_1: 'ชื่อ - นามสกุล',
        input_2: 'ชื่อบริษัทที่ทำงาน',
        input_3: 'อีเมลติดต่อ',
        input_4: 'เบอร์โทรศัพท์',
        input_5: 'แผนกหรือทีม',
        input_6: 'ตำแหน่ง ผู้ติดต่อ',
        input_7: 'หัวข้อที่ต้องการติดต่อ',
        input_8: 'คำอธิบายเพิ่มเติม',
        submit: 'ส่งข้อมูล',
        addFriends: 'เพิ่มเพื่อน',
        or: 'หรือ',
      },
    },
    footer: {
      left: 'BY iBOTNOI',
      right: 'Privacy Policy',
      right_2: 'Agreement',
    },
  },
];

const text2speech = [
  {
    mark: 'แจ้งปัญหาการใช้งานเสียงพากย์',
    downloading: 'กำลังดำเนินการ',
    note: 'หมายเหตุ',
    pinned:
      'ข้อตกลงและเงื่อนไขการใช้งาน : การใช้งาน Speech Synthetic ผู้ใช้งานสามารถนำไปใช้ในเชิงพาณิชย์ได้ โดยไม่นำเสียงไปใช้งานในทางเสียหาย เสื่อมเสีย หรือเจตนาละเมิดกฎหมายใดๆ ',
    pinned_link: 'คลิกที่นี่เพื่อดูรายละเอียดเพิ่มเติม',
    modeChange: 'สตูดิโอสร้างเสียง',
    notfoundWord: ['ไม่พบ' + 'อยู๋ในข้อความ'],
    importexport_t2s: {
      err_redirect: {
        wrong_file_form: 'กรุณาใส่รูปแบบไฟล์ที่ลงท้ายด้วย .csv',
      },
      import_file: 'นำไฟล์เข้า',
      export_file: 'นำไฟล์ออก',
    },
    storage: {
      full_storage: [
        'พื้นที่สำหรับเก็บไฟล์เสียงเต็ม! กรุณาลบไฟล์เสียงบางส่วน',
        'ไปคลังเสียง',
      ],
    },
    btn_save: 'บันทึกโปรเจค',
    conver_mode: {
      placeholder: 'พิมพ์ข้อความเพื่อสร้างเสียง',
      listening: 'ฟังเสียง',
      share_: 'แชร์',
      add_word: 'เพิ่มประโยค',
      type_word: 'พิมพ์ข้อความเพื่อสร้างเสียง',
      text_exceed: 'จำนวนข้อความเกินขีดจำกัด',
      add_quota: 'เติมโควต้า',
      err_redirect: {
        not_select_voiceover: 'กรุณาเลือกเสียงพากย์ก่อนทำการสร้างเสียง',
        len_message_overlimit: 'ข้อความที่สร้างเกินจำนวนที่กำหนดเอาไว้',
        alertSeleted: 'กรุณาเลือกเสียงพากย์ก่อนทำการสร้างเสียง',
      },
      quota: {
        no_point: 'ขออภัย พอยท์ไม่เพียงพอต่อการทำรายการ',
        success: 'เติมโควต้าสำเร็จ',
      },
      ads: {
        play_ads: 'กำลังเล่นเสียงโฆษณา',
      },
      toolbar: {
        edit_: 'แก้ไข',
        generate: 'สร้าง',
        select_voiceover: 'เลือกเสียง',
        download: 'ดาวน์โหลด',
        normal: 'ปกติ',
        soundVolume: 'ความดังเสียง',
        soundSpeed: 'ความเร็วเสียง',
        soundLang: 'เลือกภาษา',
        close: 'ลบกล่องข้อความ',
        point: 'พอยท์',
        bath: 'บาท',
        downloadBtnText: 'ดาวน์โหลด',
        err_redirect: {
          not_select_voiceover: 'กรุณาเลือกเสียงพากย์ก่อนทำการสร้างเสียง',
        },
        mainLang: 'ภาษาหลัก',
        addonsLang: 'ภาษาเพิ่มเติม',
        cutTextHover: 'แบ่งข้อความ: ตัดแบ่งข้อความออกเป็นกล่องสร้างเสียงใหม่',
        delayHover:
          'หน่วงเวลาเสียงพูด: เพิ่มการเวลาหน่วง เสียงพูดในตำแหน่งที่ต้องการในประโยค',
        quotaUsedText: 'ใช้ไป ',
        quotaTooltip:
          'เติมโควต้า: กดปุ่ม +เติมโควต้า เพื่อใช้ 100 พ้อยท์ แลกรับโควต้าคืนทั้งหมดทันที',
        playQuotaTooltip: [
          'โควต้าเล่นเสียงจะถูกจำกัดไว้ต่อวันตามแต่ละแพ็คเกจ',
          'คุณสามารถดาวน์โหลดเสียงเพื่อรับโควต้าคืน',
          'หรือ สมัครแพ็คเกจที่สูงขึ้นเพื่อรับจำนวนโควต้าที่มากขึ้น',
          'หรือ รอ 24 ชม. เพื่อรีเซ็ตใหม่อีกครั้ง',
          'หรือกดปุ่ม +เติมโควต้า เพื่อใช้ 100 พ้อยท์ แลกรับโควต้าคืนทั้งหมดทันที',
        ],
      },
      alert: [
        {
          header: 'เติมโควต้า',
          details:
            'คุณยืนยันที่จะใช้ 100 พ้อยท์ ในการเติมเพื่อรีเซ็ตโควต้าทั้งหมดทันทีหรือไม่',
          cancel: 'ไม่ต้องการ',
          confirm: 'ยืนยัน',
        },
        {
          header: 'ข้อความยาวเกินขีดจำกัด',
          details_1: 'เนื่องจากแพ็คเกจปัจจุบันของท่านคือ ',
          details_2: ' ขณะนี้ระบบได้จำกัดการสร้างเสียงไว้ที่ ',
          details_3: ' ตัวอักษร',
          promotion: ['แพคเกจสำหรับคุณ!', 'เพิ่มขีดจำกัดความยาวของตัวอักษร'],
          advantage: {
            text_limit: ['สร้างเสียงได้ ', ' ตัวอักษร/กล่องเสียง'],
            point: ['แถมฟรี ', ' พ้อยต์'],
          },
          cancel: 'เข้าใจแล้ว',
          confirm: 'สมัคร',
          currency: 'บาท',
          month: 'เดือน',
        },
        {
          header: 'พ้อยท์ของคุณไม่พอ',
          details: 'จำนวนพ้อยท์ไม่พอ คุณต้องการซื้อพ้อยท์เพิ่มหรือไม่',
          cancel: 'ไม่ต้องการ',
          confirm: 'ซื้อพ้อยท์',
        },
        {
          header: 'ไม่สามารถบันทึกโปรเจกต์ได้',
          details:
            'เนื่องจากแพ็คเกจปัจจุบันของท่านคือ Free แพ็คเกจ ทำให้ไม่สามารถบันทึกโปรเจกต์ได้ หากต้องการบันทึกโปรเจกต์ กรุณาอัปเกรดแพ็กเกจของท่าน',
          cancel: 'เข้าใจแล้ว',
          confirm: 'อัปเกรด',
        },
        {
          header: 'โควต้าเล่นเสียงถึงขีดจำกัด',
          detail_1: 'เนื่องจากแพ็คเกจปัจจุบันของท่านคือ',
          detail_2: ' แพ็คเกจ ซึ่งถูกจำกัดโควต้าไว้ที่',
          detail_3: 'โควต้า',
          sub_detail_1: 'คุณสามารถดาวน์โหลดเสียงเพื่อรับโควต้าคืน ',
          sub_detail_2:
            'หรือ สมัครแพ็คเกจที่สูงขึ้นเพื่อรับจำนวนโควต้าที่มากขึ้น',
          sub_detail_3: 'หรือหลังเที่ยงคืนของวันถัดไป เพื่อรีเซ็ตใหม่อีกครั้ง',
          sub_detail_4:
            'หรือกดปุ่ม ใช้ 100 พ้อยท์ ด้านล่างเพื่อรีเซ็ตโควต้าทั้งหมดทันที',
          upgrade: 'อัปเกรด',
          reset: 'ใช้ 100 พ้อยท์',
        },
        {
          header: 'เริ่มทดลองใช้งานแพ็คเกจ Mini ฟรี 1 วัน',
          details:
            'ปลดล็อกบริการพรีเมียมของเราด้วยการทดลองใช้งานฟรี 1 วัน ไม่มีค่าใช้จ่าย',
          cancel: 'ยกเลิก',
          confirm: 'ลองเลย',
        },
      ],
      snackbar: [
        {
          sound_success: 'สร้างเสียงสำเร็จ',
          sound_error: 'สร้างเสียงไม่สำเร็จ',
        },
      ],
    },
    play_download: {
      total_pay_point: 'พอยท์ที่ต้องจ่าย',
      point: 'พอยท์',
      createSound: 'สร้างเสียง',
      playAll: 'เล่นเสียงทั้งหมด',
      pauseAll: 'หยุดเล่นทั้งหมด',
      downloadAll: 'ดาวน์โหลดทั้งหมด',
      currency: 'บาท',
    },
    panel_replaceword: {
      title: 'แก้ไขคำอ่านผิด',
      writing: 'คำเขียน',
      ex_writing: 'ตัวอย่าง เช่น อูเบอร์',
      reading: 'คำอ่าน',
      ex_reading: 'ตัวอย่าง เช่น อูเบ้อร์',
      writing_: 'ตัวอย่าง เช่น อูเบอร์',
      reading_: 'ตัวอย่าง เช่น อูเบ้อร์',
      addWord: 'เพิ่มคำอื่น ๆ',
      save: 'บันทึก',
      history_edit: 'ประวัติแก้ไขคำอ่านผิด',
      currency: 'บาท',
      viewAll: 'ดูทั้งหมด',
      toV1: 'ใช้สตูดิโอสร้างเสียงเวอร์ชันเก่า',
      card: {
        header: 'มีโฆษณารบกวนใช่ไหม ?',
        detail: 'สมัครใช้แพคเกจ No ads เพื่อปิดเสียงโฆษณา รบกวนดูสิ',
        btn: 'สมัครตอนนี้',
      },
      err_redirect: {
        no_history: 'ยังไม่มีประวัติการแก้ไขคำอ่านผิด',
      },
      play_download: {
        total_pay_point: 'ดาวน์โหลดเสียงทั้งหมด',
        point: 'พอยท์',
        createSound: 'สร้างเสียง',
        playAll: 'เล่นเสียงทั้งหมด',
        pauseAll: 'หยุดเล่นทั้งหมด',
        downloadAll: 'ดาวน์โหลดทั้งหมด',
      },
      tools: {
        title: 'นำไฟล์เข้า/นำไฟล์ออก',
        info: 'ประเภทไฟล์ที่รองรับ .csv',
      },
      subscription: {
        title: 'แพ็คเกจสมาชิก',
      },
      play_quota: {
        text: 'โควต้าสร้างเสียงประจำวัน',
        tip: 'ตัวอักษรสำหรับสร้างเสียงจะถูกจำกัด จำนวนการใช้ต่อวันตามแพ็คเกจ สามารถกดดาวน์โหลดเสียงเพื่อคืนโควต้าบางส่วน หรือ รอหลังเที่ยงคืนเพื่อรีเซ็ตอัตโนมัติ',
        btn_add: 'เพิ่มโควต้าสร้างเสียง',
        exceed: 'โควต้าสร้างเสียงหมดแล้ว',
        dialog: {
          reset: 'ใช้ 100 พ้อยท์ เพื่อเพิ่มโควต้าของคุณ?',
          yes: 'ยืนยัน',
          no: 'ยกเลิก',
          title: 'เพิ่มโควต้าการเล่น',
          no_point: 'ขออภัย พอยท์ไม่เพียงพอต่อการทำรายการ',
          success: 'เติมโควต้าสำเร็จ',
        },
      },
      monthly_point: {
        text: 'พ้อยท์รายเดือน',
        tip: 'พ้อยท์ที่ได้ฟรีทุกเดือนตามระดับสมาชิก เมื่อมีการดาวน์โหลดจะคำนวณตัดส่วนพ้อยท์รายเดือนก่อน หากพ้อยท์รายเดือนหมดแล้วจะตัดส่วนพ้อยท์หลักตามปกติ',
      },
      form_add: {
        title: 'เพิ่มโควต้าสร้างเสียง',
        label: 'จำนวนโควต้าสูงสุดที่เพิ่มได้คือ',
        placeholder: 'กรอกจำนวนพ้อยท์',
        btn: 'ตกลง',
      },
      survey: {
        text: 'ตอบ Survey รับฟรี 1,200 พอยท์',
      },
    },
    toolbar_dropdown: {
      topic: 'กรุณาเลือกเสียงพากย์ก่อนกดปุ่มสร้างเสียง',
      downloading: 'กำลังโหลด',
      listening: 'ฟังเสียง',
      pause: 'หยุดเล่น',
      selecVoiceover: 'เลือกเสียงพากย์',
      speedTooltip: 'ความเร็วเสียง',
      volumeTooltip: 'ความดังเสียง',
      normal: 'ปกติ',
      generate: 'สร้าง',
      save: 'บันทึก',
    },
    err_redirect: {
      storage_full: 'พื้นที่สำหรับเก็บไฟล์เสียงเต็ม! กรุณาลบไฟล์เสียงบางส่วน',
      not_found_word_front: 'ไม่พบ',
      not_found_word_back: 'อยู๋ในข้อความ',
    },
    workspace: {
      project: 'โปรเจค',
      view: 'ดูโปรเจคทั้งหมด',
      create: 'สร้างโปรเจคใหม่',
    },
  },
];

const feedback_form = [
  {
    header: {
      title: 'แจ้งปัญหาการใช้งาน',
    },
    data_form: {
      title: 'หัวข้อที่ต้องการแจ้ง',
      voiceover: 'เสียงพากย์ที่พบปัญหา',
      word: 'ประโยคที่พิมพ์แล้วพบปัญหา',
      problemMessage: 'รายละเอียด',
      enterName: 'ชื่อ - นามสกุลผู้แจ้ง',
      phone: 'เบอร์โทรศัพท์ติดต่อ',
      email: 'อีเมลติดต่อ',
      category: [
        'เติมเงินไม่ได้พ้อยท์',
        'ปัญหาการใช้งานทั่วไป',
        'แนะนำและติชม',
        'ปัญหาเกี่ยวกับเสียงพากย์',
      ],
      to_facebook:
        'สามารถติดต่อเราได้ที่ เพจ Facebook ชื่อ Botnoi Voice - Text To Speech',
    },
    err_redirect: {
      select_topic: 'กรุณาเลือกหัวข้อ',
      select_voiceover: 'กรุณากรอกเสียงพากย์',
      enter_word: 'กรุณาประโยคที่พิมพ์',
      problem_message: 'ปัญหาการใช้งานที่พบ',
      img_button: 'แนบไฟล์รูปภาพ',
      note: 'หมายเหตุ : กรุณาแนบไฟล์รูปภาพหรือสลิปการชำระเงิน (ไม่จำเป็น)',
      not_enter_name: 'กรุณากรอกชื่อ - นามสกุล',
      not_enter_phone: 'กรุณากรอกเบอร์โทรศัพท์ติดต่อ',
      not_enter_email: 'กรุณากรอกอีเมลติดต่อ',
      submit: 'ส่งข้อมูลปัญหาการใช้งาน',
    },
    alertText: {
      successSending: 'ส่งข้อมูลสำเร็จ',
    },
  },
];

const word_store = [
  {
    topic_word: 'คลังคำศัพท์',
    addWrongWord: 'เพิ่มคำอ่านผิด',
    searching: 'ค้นหา',
    searchingWord: 'ค้นหาคำเขียน',
    dateTime: ['วันที่/เวลา', 'น.'],
    reading: 'คำอ่าน',
    writing: 'คำเขียน',
    edit_writing: 'คำอ่านที่ถูกแก้ไข',
    listening: 'ฟังเสียง',
    liste: 'ฟัง',
    edit: 'แก้ไข',
    accept: 'ตกลง',
    cancel: 'ยกเลิก',
    delete: 'ลบ',
    remove: 'นำออก',
    err_redirect: {
      not_found: 'ไม่พบข้อมูล',
    },
  },
];

const audio_storage = [
  {
    main: {
      header: {
        text: 'คลังเสียงของฉัน',
        storage: {
          left: {
            storage_text: 'พื้นที่เก็บข้อมูล',
            not_display: 'Not display',
          },
          right: ['ใช้ไปแล้ว', 'จาก'],
        },
      },
      body: {
        title: 'ไฟล์เสียงทั้งหมด',
        upload: 'อัปโหลด',
        page: 'หน้า',
        see_word: 'ดูข้อความ',
        closeWindow: 'ปิดหน้าต่างนี้',
        copytext: 'คัดลอกข้อความ',
        action_before: '',
        clean_choice: 'ล้างตัวเลือก',
        bt_matTooltip: 'ดาวน์โหลดไฟล์เสียง',
        download: 'ดาวน์โหลด',
        delete: 'ลบทิ้ง',
        deleteAll: 'ลบทั้งหมดในคลัง',
        // not sure what is this mean - 135
        temp: ['เลือกทั้งหมด (หน้า ', ')'],
      },
    },
    floating_message: {},
  },
];

const wallet = [
  {
    main_text_PromotionFirst: [
      'โปรโมชั่น Grand Opening',
      'วันนี้ - 30 ตุลาคม พ.ศ. 2564',
    ],
    main_text_PromotionSecord:
      'เปิดใช้งานเว็บไซต์ครั้งแรกเพียงเติมพอยท์ตอนนี้ จะได้รับโบนัสพิเศษ',
    my_point: 'พอยท์ของคุณ',
    my_package: 'ระดับสมาชิก',
    noted: 'ขอใบกำกับภาษี',
    clicke: 'คลิกที่นี่',
    problem: 'พอยท์ไม่เข้า',
    input_point: 'ระบุจำนวนพอยท์ที่ต้องการซื้อ',
    input_point_tip:
      'เนื่องจากจำนวนพอยท์ที่คุณกรอกมีค่าเท่ากับจำนวนพอยท์อีกจำนวนหนึ่งที่จ่ายในราคาเดียวกัน ระบบจึงต้องปัดจำนวนพอยท์ให้อัตโนมัติเพื่อความคุ้มค่าในการซื้อพอยท์',
    bath: 'บาท',
    point: 'พอยท์',
    promotin_show: 'ได้โบนัสพิเศษ',
    navigate: [
      'ซื้อพอยท์',
      ' แพ็คเสริม',
      'เชิญเพื่อนได้พอยท์',
      'อัดเสียงแลกพอยท์',
      'ใช้โค้ด',
    ],
    buy_points: {
      title: 'ยิ่งซื้อเยอะยิ่งคุ้ม!!',
      sub_title: ['จากปกติ 40 พ้อยท์ / ', 1],
      event_sub_title: 'จำนวนจำกัด รีบซื้อเลย!',
      title_input: 'ซื้อพ้อยท์แบบกำหนดเอง',
      ...inputPoint,
      toggle_list: ['ครั้งคราว', 'อดิเรก', 'ใช้ประจำ', 'บุฟเฟต์'],
      tag_list: [
        'แพ็กเกจผู้เริ่มต้น',
        'แพ็กเกจผู้ใช้ประจำ',
        'แพ็กเกจผู้เชี่ยวชาญ',
        'แพ็กเกจบุฟเฟต์',
      ],
      tag_sale_event: 'PROMOTION จำกัด 1/1',
      more: 'ดูราคาอื่นๆ',
      discount_list: [
        {},
        {
          text: 'สุดคุ้ม',
          discount: 'ลด 35%',
        },
        {
          text: 'สุดคุ้ม',
          discount: 'ลด 50%',
        },
        {
          text: 'สุดคุ้ม',
          discount: 'ลด 40%',
        },
      ],
      description_list: [
        'มาไม่บ่อย? ไม่เป็นไร! จ่ายเบา ๆ แถมพ้อยท์ทำ Tiktok สไลด์ส่งงานด้วย',
        'จบงานง่ายสบายกระเป๋า ทั้งทำข่าวทั้งแปลหนัง',
        'ได้พ้อยท์แบบคุ้มที่สุด ทำหนังสือก็ไหว ทำคอนเทนต์ยาวๆก็ปัง',
        'ดาวน์โหลดได้ไม่จำกัด ไม่มีโฆษณา เฉพาะบนแพลตฟอร์ม ไม่มี API',
      ],
      unlimited_desc: '*โปรโมชั่นโหลดไม่อั้นไม่มี API',
      buy: 'ซื้อ',
      free_gift: ['แถมฟรี ', ' เดือน'],
      unlimited: 'โหลดไม่อั้น',
      day: 'วัน',
      worth: 'คุ้มเวอร์',
      discount: 'ภายใน',
      rank: ['แพคเกจปัจจุบันของคุณ : ', ' ได้พ้อยท์เพิ่มเติมเมื่อซื้อพ้อยท์'],
      no_point: ['แต้มยังไม่พอใช่มั้ย  ลองดูโปรโมชั่นถัดไป', 'คุ้มยิ่งกว่า'],
      back: 'ย้อนกลับ',
    },
    total: ['เฉลี่ย ', ' บาท'],
    recommend_popup: {
      header: 'คุ้มค่ากว่า',
      text: 'หากซื้อแพ็กเกจ',
      text2: 'แถม',
      bonus: 'ได้โบนัสพิเศษ ฟรี',
      ask: 'ต้องการเปลี่ยนไปซื้อแพ็กเกจที่เราแนะนำหรือไม่ ?',
      offer: 'ซื้อแพ็กเกจที่เราแนะนำ',
      back: 'กลับไปซื้อแพ็กเกจที่คุณเลือก',
    },
    invite_page: {
      main_text_invite: ['รับฟรี 500 พอยท์ มูลค่า ', 10, ' / การลงทะเบียน'],
      invite_one: ['เชิญเพื่อน 1 คน ', 'รับฟรี', '500 พอยท์'],
      invite_ten: ['เชิญเพื่อน 10 คน ', 'รับฟรี', '5,000 พอยท์'],
      invite_100: ['เชิญเพื่อน 100 คน ', 'รับฟรี', '50,000 พอยท์'],
      sub_text_invite:
        'เพียงส่งคิวอาร์โค้ดหรือลิงค์เชิญให้เพื่อนร่วมลงทะเบียนใช้งาน Botnoi Voice',
      link_invite: 'ลิงค์เชิญ :',
      noted: [
        'หมายเหตุ',
        'คุณเชิญเพื่อนครบจำนวนจำกัด 10 คนแล้วไม่สามารถเชิญเพื่อนได้อีก',
      ],
      copy_link: 'คัดลอกลิงค์',
      number_link: ['คำเชิญทั้งหมด', 'คำเชิญ'],
      qr_maintext: 'คิวอาร์โค้ดเชิญเพื่อน',
    },
    record_voice: {
      record_point: ['พอยท์จากการอัดเสียง', 'PT'],
      next: 'ข้าม',
      record_contain: ['อ่าน', 'จำนวนครั้งที่อ่าน', 'ครั้ง'],
      read_again: 'อ่านใหม่อีกครั้ง',
      sent_audio: 'ส่งไฟล์เสียง',
      play_audio: 'เล่นเสียง',
      err_redirect: {
        text_press_putMicrophoneBT: 'กดปุ่มไมค์เพื่ออ่านข้อความดังกล่าว',
        can_use_on_Chrome:
          'ขณะนี้ระบบอัดเสียงรองรับเพียงบราวเซอร์ Chrome ขออภัยในความไม่สะดวก',
        wordOut: 'ข้อความหมดแล้ว',
        err_type_text: 'หมวดหมู่นี้ ยังไม่มีข้อความ',
      },
      record_information: {
        recommend: 'คำแนะนำในการอัดเสียง',
        text_right: [
          'กรุณาอัดเสียงในบริเวณที่ไม่มีเสียงรบกวนและ',
          'ใช้ไมโครโฟนในการอัดเสียงเพื่อคุณภาพเสียงที่ดีขึ้น',
        ],
        stepRecord: 'ขั้นตอนการอัดเสียง',
        pushMic: 'กดปุ่มไมค์',
        begidRecord: 'เพื่อเริ่มต้นการอัดเสียง',
        recordMethod: [
          'อ่านข้อความข้างต้นดังกล่าวจนจบ',
          'ระบบจะทำการอัดเสียงของผู้ใช้งานเอาไว้',
          'เมื่ออ่านจบแล้วให้กดที่ไมค์อีกครั้งเพื่อหยุด',
          '',
          'หากผู้ใช้งานต้องการฟังเสียงของตัวเองที่อัดไป',
          'หรือหากอยากอัดเสียงใหม่อีกรอบให้กดปุ่ม อ่านใหม่อีกครั้ง',
          'เมื่อพอใจในเสียงที่อัดแล้ว ให้กดปุ่มส่งไฟล์เสียง',
          'ก็เป็นอันเสร็จสิ้นและเริ่มอ่านข้อความถัดไป',
          'ผู้ใช้งานสามารถเปลี่ยนหมวดของข้อความที่อ่านได้และ',
          'สามารถกดข้ามเพื่อเปลี่ยนข้อความใหม่ได้ตามต้องการ',
        ],
      },
    },
    coupon_code: {
      code_: 'โค้ด',
      couponInput: 'ใส่โค้ดที่นี่',
      access: 'ยืนยัน',
      redirect: {
        incorrect:
          'ไม่พบโค้ดนี้ โค้ดอาจจะไม่สามารถใช้งานได้แล้วหรือโค้ดที่คุณเพิ่มไม่ถูกต้อง',
        success: 'เติมโค้ดสำเร็จแล้ว',
        alreade_use: 'โค้ดของคุณถูกใช้งานแล้ว',
        expired: 'โค้ดของคุณหมดอายุการใช้งานแล้ว',
        notFillCoupon: 'กรุณาใส่โค้ดของคุณ',
      },
    },
    alert: {
      buy_points: 'เติมเงินสำเร็จ',
      subscription: 'สมัครแพ็คเกจสำเร็จ',
      alert_success_point: {
        header: 'ชำระเงินสำเร็จ',
        details: 'ได้รับพ้อยท์แล้ว',
        ok: 'ไปหน้าสตูดิโอ',
        close: 'ปิด',
        getpoints_text: 'คุณได้รับพ้อยท์จำนวน',
        point: 'พ้อยท์',
        right: 'และได้รับสิทธิใช้',
        right2: 'ได้รับสิทธิใช้',
        package_noadds: 'แพ็คเกจ No ads ฟรี',
        package_unlimited: 'แพ็คเกจ Unlimited',
        day: 'วัน',
        month: 'เดือน',
        ps: 'หากต้องการขอใบกำกับภาษี สามารถติดต่อได้ที่ admin@botnoigroup.com สามารถขอย้อนหลังได้ไม่เกิน 15 วัน',
      },
      alert_success_package: {
        header: 'ชำระเงินสำเร็จ',
        details: ' แพ็คเสริม No Ads สำเร็จแล้ว',
        ok: 'ไปหน้าสตูดิโอ',
        close: 'ปิด',
        right2: 'ได้รับสิทธิใช้',
        day: 'วัน',
        ps: 'หากต้องการขอใบกำกับภาษี สามารถติดต่อได้ที่ admin@botnoigroup.com สามารถขอย้อนหลังได้ไม่เกิน 15 วัน',
      },
      alert_error: {
        header: 'ชำระเงินไม่สำเร็จ',
        details:
          'ขออภัย การชำระเงินของคุณไม่สำเร็จ โปรดติดต่อเจ้าหน้าที่เพื่อแก้ไขปัญหา',
        ok: 'ติดต่อเจ้าหน้าที่',
      },
    },
  },
];

const upsell = {
  header: {
    text: 'พ้อยท์ไม่เพียงพอ',
    sub: ['คุณต้องใช้ ', ' พ้อยท์ ในการดาวน์โหลดเสียง'],
    text_noads: 'ซื้อพ้อยท์ได้ของแถม',
    sub_noads: ['คุ้มกว่า! ', 'เมื่อซื้อพ้อยท์แถม No Ads'],
  },
  content: {
    ...inputPoint,
    btn: 'ซื้อ',
    special_text: [
      'พิเศษ!',
      ' เมื่อซื้อโปรโมชั่นสุดคุ้มตอนนี้ รับพ้อยท์เพิ่มขึ้นถึง 50%',
    ],
    free_gift: ['แถมฟรี ', ' เดือน'],
    countdown: 'ภายใน ',
    footer: ['ดูโปรโมชั่นส่วนลดสุดคุ้มอื่นๆ ', 'คลิก'],
  },
};

const report = {
  report_title: 'แจ้งปัญหาการใช้งาน',
  report_details:
    'ช่องทางในการแจ้งปัญหาการใช้งาน การสมัครแพ็คเกจ หรือการซื้อพ้อยท์',
  report_button: 'ติดต่อผู้ดูแล',
};

const marketplace = [
  {
    selectVoiceover: 'เลือกเสียงพากย์',
    addVoiceover: 'เพิ่มเสียงพากย์',

    recommend: 'เสียงพากย์ที่แนะนำ',
    seeAll: 'ดูเสียงนักพากย์ทั้งหมด',

    searchVoiceover: 'ค้นหาเสียงพากย์ที่ต้องการเพิ่ม',
    searchVoiceover_result: 'ค้นหาเสียงพากย์ที่คุณเพิ่มเข้ามา',

    search: 'search',
    cancel: 'cancel',

    style_: 'สไตล์',
    delete_Voiceover: 'ลบเสียงพากย์',
    play: 'เล่นเสียง',
    pause: 'หยุดเล่น',
    touse: 'วิธีการใช้งาน',

    add_: 'add',
    remove_: 'remove',

    err_redirect: {
      notFound_result: 'ไม่พบผลลัพท์ที่คุณค้นหา',
      pleaseAddVoiceover:
        'กรุณาเพิ่มเสียงพากย์ในสตูดิโอของคุณ คลิกปุ่มด้านล่าง',
    },
    marketplace_alert: {
      //toolbar_dropdown
      alert_text: 'ยืนยันการเอาเสียงพากย์นี้ออกจากสตูดิโอสร้างเสียง',
      addOnCart: 'เพิ่มเสียงพากย์ในสตูดิโอสร้างเสียงของคุณแล้ว',
      removeOnCart: 'เอาเสียงออกจากสตูดิโอสร้างเสียงของคุณแล้ว',
      text: ['คุณต้องการเอาออก', 'รายการใช่หรือไม่'],
      cancel: 'ยกเลิก',
      access: 'ยืนยัน',
    },
    floating_message: {},
    marketplace_search: {
      selectvoiceover: 'เลือกเสียงพากย์',
      text_detail:
        'แหล่งรวบรวมเสียงของ Botnoi Voice ทั้งหมดไว้ที่นี้ให้คุณเลือกสรร',
      search_text: 'ค้นหาเสียงที่คุณต้องการ',
      filter_: 'Filter',
      filterSearch: {
        access: 'ยืนยัน',
        soundCategory_text: 'หมวดหมู่ของเสียง',
        soundStyle_text: 'สไตล์ของเสียง',
        gender_text: 'เพศ',
        language_text: 'เสียงภาษา',
        soundCategory: [
          'ยอดนิยม',
          'การบรรยาย',
          'อ่านข่าว',
          'พากย์ละคร',
          'พากย์การ์ตูน/อนิเมะ',
          'สำเนียงอื่นๆ',
          'ทั่วไป',
        ],
        soundStyle: [
          'สไตล์อ่านข่าว',
          'สไตล์เล่าเรื่อง',
          'สไตล์สปอตโฆษณา',
          'สไตล์สารคดี',
          'สไตล์บรรยาย',
          'สไตล์เล่านิทาน',
          'สไตล์อาจารย์',
          'สไตล์ตัวละคร',
          'สไตล์อนิเมะ',
          'สไตล์ท้องถิ่น',
          'สไตล์เสียงต่างประเทศ',
        ],
        voiceStyle: [
          'เสียงน่ารัก',
          'เสียงน่าเชื่อถือ',
          'เสียงตื่นเต้น',
          'เสียงมั่นใจ',
          'เสียงชัดเจน',
          'เสียงหวาน',
          'เสียงจริงจัง',
          'เสียงอ้อน',
          'เสียงใจเย็น',
          'เสียงทุ้ม',
          'เสียงอบอุ่น',
          'เสียงก้อง',
          'เสียงนางเอก',
          'เสียงพระเอก',
          'เสียงตัวร้าย',
          'เสียงขี้เล่น',
          'เสียงละมุน',
          'เสียงยียวน',
          'เสียงนุ่มนวล',
          'เสียงท้องถิ่น',
          'เสียงเหนือ',
          'เสียงสุพรรณ',
          'เสียงอีสาน',
          'เสียงสนุกสนาน',
          'เสียงเนิบๆ',
        ],
        gender: ['ผู้ชาย', 'ผู้หญิง', 'เด็ก', 'ผู้ใหญ่', 'คนแก่'],
        language: ['ภาษาไทย', 'ภาษาอังกฤษ'],
      },
    },
    lasted_sound: {
      topic: 'เสียงเพิ่มเข้ามาใหม่',
      addSound: ['เพิ่มเสียงพากย์', 'add'],
      removeSound: ['ลบเสียงพากย์', 'remove'],
      play: 'เล่นเสียง',
      pause: 'หยุดเล่น',
      sound: 'เสียง',
    },
    category_sound: {
      topic: 'เสียงพากย์ทั้งหมดในระบบ',
      caregory: [
        'หมวดหมู่ของเสียง',
        [
          'ทั้งหมด',
          'ยอดนิยม',
          'การบรรยาย',
          'อ่านข่าว',
          'พากย์ละคร',
          'พากย์การ์ตูน/อนิเมะ',
          'สำเนียงอื่นๆ',
          'ทั่วไป',
        ],
      ],
      result: 'ผลลัพท์การค้นหา',
      clearSearch: 'เคลียร์ข้อมูลการค้นหา',
      result_num: ['มีทั้งหมด', 'รายการ'],
      picture: 'รูปภาพ',
      name: 'ชื่อ',
      table: [
        'เพศ',
        'เสียงภาษา',
        'ยอดดาวน์โหลด',
        'สไตล์เสียง',
        'เพิ่มเสียง',
        'เล่นเสียง',
      ],
      numberWithCom: 'ครั้ง',
      style: 'สไตล์',
      addCart_: ['เพิ่มเสียงพากย์', 'add'],
      removeCart_: ['ลบเสียงพากย์', 'remove'],
      personPlay: ['เล่นเสียง', 'หยุดเล่น'],
      redirect: {
        notFoundResult: 'ไม่พบผลลัพท์ที่คุณค้นหา',
      },
    },
    topten_sound: {
      topic: '10 ลำดับเสียงพากย์สุดฮอต',
      addCart_: ['เพิ่มเสียงพากย์', 'add'],
      removeCart_: ['ลบเสียงพากย์', 'remove'],
      personPlay: ['เล่นเสียง', 'หยุดเล่น'],
      numberWithCom: 'ครั้ง',
    },
    studio_sound: {
      topic: 'เสียงพากย์ในสตูดิโอสร้างเสียง',
      remove: 'เอาออกจากสตูดิโอ',
      selectAll: 'เลือกทั้งหมด',
      accessRemove: 'ยืนยันการเอาออก',
      delete: ['ลบเสียงพากย์', 'remove'],
      personPlay: ['เล่นเสียง', 'หยุดเล่น'],
    },
    add_cart: {
      header: 'เสียงที่ต้องการเพิ่มไปยังสตูดิโอสร้างเสียง',
      result_false: 'คุณยังไม่ได้ทำการเพิ่มเสียงไปยังสตูดิโอสร้างเสียง',
      add_btn: ['กดปุ่ม', 'เพื่อเพิ่มเสียง'],
      result: ['เพิ่มทั้งหมด', 'รายการ'],
      total: ['รวมทั้งหมด', 'เสียง'],
      saveSpeaker_: 'บันทึกข้อมูล',
    },
  },
];

const api_tutorial = [
  {
    guide_header: 'คู่มือการใช้งาน',
    ex_api: 'ตัวอย่างการใช้งาน API นี้',
    chang: 'เปลี่ยน',
    forDev_header: 'สำหรับนักพัฒนา',
    copyDetail: 'สามารถคัดลอก Code ส่วนนี้ไปใช้งานได้เลย',
    copy: 'คัดลอก',
    text_exampleApi: 'ทดสอบเอพีไอ',
    textOnbodySending: 'สวัสดี',
    redirect: {
      copyComplete: 'คัดลอกสำเร็จ',
    },
  },
];

const share = [
  {
    title_nameFile: 'ตั้งชื่อไฟล์เสียง',
    input_nameFile: 'ชื่อไฟล์',
    title_imageFile: 'อัปโหลดรูปพื้นหลัง',
    input_editImage: 'edit',
    input_editbackgroundImage: 'แก้ไขรูปพื้นหลัง',
    fileDownload: 'file_download',
    uploadImage: 'อัปโหลดรูป',
    share_: 'แชร์',
    err_redirect: {
      imageType: 'รองรับรูปภาพนามสกุล .jpg .jpeg .png เท่านั้น',
    },
  },
];

const addcart_alert = [
  {
    text_1: 'ต้องการออกจากหน้านี้ใช่ไหม',
    text_2: 'คุณยังไม่ได้บันทึกข้อมูลการเพิ่มเสียงในสตูดิโอ',
    text_3: 'แน่ใจหรือไม่ว่าต้องการออกโดยที่ยังไม่ได้บันทึกข้อมูล',
    exit: 'ออกจากหน้านี้',
    exitSave: 'บันทึกข้อมูลและออกจากหน้านี้',
  },
];

const dialog = [
  {
    backButton: 'กดปุ่มตกลงเพื่อกลับไปหน้า',
    pay4point: ['คุณสามารถซื้อพอยท์เพิ่ม', 'เติมพอยท์'],
    toPayment: 'ไปหน้าเติมเงิน',
    warning:
      'หากคุณออกจากหน้านี้ งานที่ทำจะไม่ถูกบันทึก ทางเราแนะนำให้เก็บข้อความที่สร้างไว้ป้องกันงานสูญหาย',
    invite4point: [
      'เชิญเพื่อนร่วมลงทะเบียนใช้งาน Botnoi voice ก็จะได้รับพอยท์ฟรี',
      'เชิญเพื่อนได้พอยท์ ฟรี',
    ],
    record4point: ['อัดเสียงแลกพอยท์ฟรีได้', 'อัดเสียงแลกพอยท์ ฟรี'],
    btBelow: 'คลิกปุ่มด้านล่าง',
    or: 'หรือ',
    accept: 'ตกลง',

    redirect: {
      err_1: 'เกิดข้อผิดพลาดบางประการ',
      notEnoughPoint: 'พอยท์ของคุณไม่พอ',
      notEnoughCoin: ['ต้องการอีก', 'พอยต์', 'เป็นจำนวนเงิน', 'บาท'],
    },
    dialogPaid: {
      alert: 'ไม่มีโค้ดเนมนี้ในระบบ',
      confirm: 'ยืนยัน',
      cancel: 'ยกเลิก',
      paidPayment: 'ชำระเงิน',
      orderList: 'รายการสั่งซื้อ',
      stepPaid: 'วิธีการชำระเงิน',
      qrScan: 'สแกน QR Code',
      serviceFee: '(ค่าดำเนินการ + 10 บาท)',
      concludePayment: 'ราคาทั้งหมด',
      timelimit: 'เวลา QR Code จะหมดอายุใน',
      second: 'วินาที',
      outofTimelimit: 'QR Code ของคุณหมดอายุแล้ว',
      saveqr: 'บันทึก QR CODE',
      codename: 'กรอกโค้ดเนม',
      warning: 'กรุณาอย่าปิดหน้านี้ ก่อนทำรายการเสร็จสมบูรณ์',
      recommend: 'รีโหลดเว็บไซต์หากพ้อยท์ไม่เข้า',
      mobile:
        'หากใช้งานเว็บไซต์ด้วยโทรศัพท์ แนะนำให้เติมเงิน 10 บาทขึ้นไปเพื่อเลี่ยงปัญหาการเติมเงินพ้อยท์ไม่เข้า',
    },
  },
];

const audioPlan = [
  {
    title: 'ฟรี',
    image: 'free',
    size: '100 MB',
    lists: ['พื้นที่เก็บข้อมูลขนาด 100 MB'],
    price: {
      monthly: 'แพ็กเกจปัจจุบัน',
      yearly: 'แพ็กเกจปัจจุบัน',
    },
  },
  {
    title: 'พื้นฐาน',
    image: 'basic',
    size: '1 GB',
    lists: ['พื้นที่เก็บข้อมูลขนาด 1 GB', 'ได้รับ 250 พอยท์ / เดือน'],
    price: {
      monthly: '50 บาท / เดือน',
      yearly: '500 บาท / ปี',
    },
  },
  {
    title: 'มาตรฐาน',
    image: 'standard',
    size: '10 GB',
    lists: ['พื้นที่เก็บข้อมูลขนาด 10 GB', 'ได้รับ 1,000 พอยท์ / เดือน'],
    price: {
      monthly: '150 บาท / เดือน',
      yearly: '1,500 บาท / ปี',
    },
  },
  {
    title: 'พรีเมียม',
    image: 'premium',
    size: '100 GB',
    lists: ['พื้นที่เก็บข้อมูลขนาด 100 GB', 'ได้รับ 4,000 พอยท์ / เดือน'],
    price: {
      monthly: '500 บาท / เดือน',
      yearly: '5,000 บาท / ปี',
    },
  },
];

const bottomMenu = [
  {
    warn: 'กรุณาเลือกเสียงพากย์ก่อนกดปุ่มสร้างเสียง',
    setSound: 'ตั้งค่าเสียง',
    setLang: 'เลือกภาษา',
    _save: 'บันทึก',
    selectVoiceover: 'เลือกเสียงพากย์',
    genSound: 'สร้างเสียง',
    saveSet: 'บันทึกตั้งค่า',
    editWringreading: 'แก้ไขคำอ่านผิด',
    editWrongWord: 'แก้ไขคำผิด',
    selectedVoiceover: 'เลือกเสียงที่ต้องการ',
    editSpeed: 'ปรับความเร็วเสียง',
    editVolumn: 'ปรับความดังเสียง',
    historyEdit: 'ประวัติการแก้ไข',
    writing: 'คำเขียน',
    reading: 'คำอ่าน',
    _writing: 'พิมพ์คำเขียน',
    _reading: 'พิมพ์คำอ่าน',
    addAnotherword: 'เพิ่มคำอื่น ๆ',
    cancel: 'ยกเลิก',
    save: 'บันทึก',
    redirect: {
      emptyHistory: 'ยังไม่มีประวัติการแก้ไขคำอ่านผิด',
    },
    alertNotfound: ['ไม่พบ ', ' อยู่ในข้อความ'],
    mainLang: 'ภาษาหลัก',
    addonsLang: 'ภาษาเพิ่มเติม',
  },
];

const dialogconfirm = [
  {
    topic: 'เลือกนามสกุลไฟล์ที่คุณต้องการ',
    fileExtension: 'นามสกุลไฟล์เสียง',
    confirmDownload: 'ยืนยันการดาวน์โหลดไฟล์เสียง',
    paidPoint: 'พอยท์ที่ต้องจ่ายทั้งหมด',
    price: 'ราคาทั้งหมด',
    note: ['หมายเหตุ', 'หากดาวน์โหลดเสียงแล้วเสียงพื้นหลังจะหายไป'],
    cancel: 'ยกเลิก',
    confirm: 'ตกลง',
    redirect: {
      turnOnbtDownloadAll:
        'เปิดใช้งานปุ่มนี้ เพื่อทำการดาวน์โหลดไฟล์เสียงที่ต้องการระบบจะทำการ Merge ไฟล์เสียงหลายๆ ไฟล์ รวมเป็นไฟล์เสียงเดียวกัน',
      turnOnbtSaveFile:
        'เปิดใช้งานปุ่มนี้ เพื่อเก็บไฟล์เสียงที่ดาวน์โหลดเข้าคลังเสียง',
    },
    storage: {
      text: 'บันทึกไฟล์เข้าคลังเสียง',
      dropdown: ['ไม่บันทึก', 'บันทึก'],
    },
  },
];

const addworddialog = [
  {
    addWrongWord: 'เพิ่มคำอ่านผิด',
    writing_ex: ['ตัวอย่างคำเขียน', 'อูเบอร์'],
    reading_ex: ['ตัวอย่างคำอ่าน', 'อู-เบ้อ'],
    writing: 'คำเขียน',
    reading: 'คำอ่าน',
    typeWrite: 'พิมพ์คำเขียน',
    typeRead: 'พิมพ์คำอ่านสะกดคำ',
    typeReaded: 'พิมพ์คำอ่าน',
    addAnother: 'เพิ่มคำอื่นๆ',
    save: 'บันทึก',
    cancel: 'ยกเลิก',
  },
];

const audio_download = [
  {
    confirmDownload: 'ยืนยันการดาวน์โหลดไฟล์เสียง',
    cancel: 'ยกเลิก',
    accept: 'ยืนยัน',
    success: 'เสร็จสิ้น',
    downloadAll: 'ดาวน์โหลดไฟล์ทั้งหมด',
    downloadSuccess: 'ดาวน์โหลดเสร็จสิ้น',
    file_: 'ไฟล์',
  },
];

const sales = {
  topic: 'เซลล์แนะนำการขาย',
  salesname: 'Loading',
  codeName: 'โค้ดเนมของคุณ',
  copy_: 'คัดลอกโค้ดเนม',
  titleIncome: 'ยอดค่าตอบแทนของเดือนล่าสุด',
  bath: 'บาท',
  totalIncome: 'ยอดค่าตอบแทนสะสม',
  withdraw: 'ถอนเงิน',
  customerList: ['รายชื่อลูกค้า', 'ประจำเดือนกันยายน'],
  customerTotal: ['ทั้งหมด', 'รายการ'],
  balanceDate: 'ยอดระหว่างวันที่',
  currency: 'บาท',
  withdrawn_note: 'หมายเหตุ : ได้รับเงินภายใน  10 - 15 วันในเดือนถัดไป',
  successCopy: 'คัดลอกสำเร็จแล้ว',
  viewPanel: {
    list: 'รายการ',
    total: 'ยอดรวม',
  },
  tooltips: {
    sales:
      'ระบบเซลล์แนะนำการขายใช้สำหรับให้ผู้ใช้งานที่ได้แนะนำการขายแพลตฟอร์มบอทน้อย วอยท์ให้กับลูกค้าท่านอื่นๆ หากขายได้จะได้รับส่วนแบ่งจากการขายตามที่ระบุไว้ของยอดขายที่ได้',
    balance:
      'ระบบเซลล์แนะนำการขายใช้สำหรับให้ผู้ใช้งานที่ได้แนะนำ การขายแพลตฟอร์มบอทน้อย วอยท์ให้กับลูกค้าท่านอื่นๆ หากขายได้จะได้รับส่วนแบ่งจากการขายตามที่ระบุไว้ ของยอดขายที่ได้',
    codename:
      'โค้ดเนม คือ รหัสที่มีไว้เพื่อยืนยันว่าคุณคือผู้แนะนำการขายให้กับทางลูกค้าโดยลูกค้าจะต้องทำการกรอกโค้ดเนมในส่วนของ Referral Code จึงจะทำให้คุณได้ส่วนแบ่งจากการแนะนำการขาย',
    totalbalance:
      'ยอดเงินทั้งหมดในระบบผู้ใช้งานสามารถส่งคำขอเบิกถอนเงินได้ โดยจำนวนเงินเบิกถอนต้องไม่ต่ำกว่าตามที่กำหนดไว้ ทางระบบจะโอนเงินเข้าบัญชีของท่าน ภายในระยะเวลา 10 - 15 วันของเดือนถัดไป',
  },
  table: {
    header: ['ลำดับ', 'ชื่อผู้ใช้งาน', 'ยอดซื้อ', 'ส่วนแบ่งที่ได้รับ'],
  },
  warning: {
    incomeMonth: 'ยอดเงินที่ได้รับจากการขายภายในเดือนนี้',
    incomeWithdraw: 'ยอดเงินทั้งหมดที่สามารถเบิกถอนได้',
  },
  redirect: {
    copyComplete: 'คัดลอกโค้ดเนมสำเร็จแล้ว !',
  },
};

const _auth = {
  redirect: {
    pleaseLogin: 'กรุณาเข้าสู่ระบบใหม่อีกครั้ง',
    notfoundPayment:
      'ระบบตรวจไม่พบรายการจ่ายเงินของคุณ โปรดทำให้แน่ใจว่าคุณได้ทำรายการสำเร็จแล้ว',
  },
};

const dialogMessageObj = {
  successAddPronunciation: 'บันทึกคำอ่านผิดเรียบร้อย',
  permissionCookie:
    'เว็บไซต์ของเราจะมีการใช้งานคุกกี้เพื่อการนำไปพัฒนาประสบการณ์การใช้งานเว็บไซต์ให้ดียิ่งขึ้น',
  readDetail: 'ศึกษาเพิ่มเติมที่นี่',
  acceptCookie: 'ยอมรับทั้งหมด',
  acceptDeletes: 'ยืนยันการลบข้อมูล',
  confirmDelete: 'คุณต้องการลบ',
  checkList: 'รายการใช่หรือไม่',
  cancel_: 'ยกเลิก',
  accept_: 'ยืนยัน',
  agree_: 'ตกลง',
  code_: 'โค้ด',
  file_: 'ไฟล์',
  finish_: 'เสร็จสิ้น',
  addcode: 'เพิ่มโค้ด',
  addword: 'เพิ่มคำ',
  save_: 'บันทึก',
  successfully: 'เติมโค้ดสำเร็จ',
  notEnoughpoint: 'พอยท์ของคุณไม่พอ กรุณาเติมพอยท์',
  needMorePoint: 'ต้องการซื้อพอยท์เพิ่มหรือไม่',
  acceptDownload: 'ยืนยันการดาวน์โหลดไฟล์เสียง',
  acceptPayPoint: 'ยืนยันการจ่าย Point 35 PT',
  successfulDownload: 'ดาวน์โหลดไฟล์เสียงสำเร็จ',
  downloadAllfile: 'ดาวน์โหลดไฟล์ทั้งหมด',
  finishDownloaded: 'ดาวน์โหลดเสร็จสิ้น',
  successfulPayment: 'ชำระเงินสำเร็จแล้ว',
  successfulDownloadSound: 'ดาวน์โหลดไฟล์เสียงสำเร็จ',
  ownerPoint: 'พอยท์ของคุณมี',
  returnToText2Speech: 'ตกลง',
  regidter: 'ลงทะเบียนวันนี้',
  forOffer: 'เพื่อรับข้อเสนอและส่วนลดพิเศษ',
  pleasefill: 'กรุณากรอก',
  sentdata: 'ส่งข้อมูล',

  copyComplete: 'คัดลอกลิงค์สำเร็จ',
  topicEditword: 'แก้ไขคำอ่านผิด',
  writing: 'คำเขียน',
  reading: 'คำอ่าน',
  writing_: 'พิมพ์คำเขียน',
  reading_: 'พิมพ์คำอ่านสะกดคำ',
  successfullySent: 'ส่งข้อมูลสำเร็จแล้ว',
  callbackLater: 'ทางเราจะติดต่อไปให้เร็วที่สุด ขอบคุณที่สนใจ',
  placeholderList: [
    'ชื่อจริง - นามสกุล',
    'ชื่อหน่วยงาน',
    'เบอร์โทรศัพท์ติดต่อ',
    'อีเมลติดต่อ',
    'รายละเอียดเพิ่มเติม',
  ],
  alertMessage: {
    notFoundCode:
      'ไม่พบโค้ดนี้ โค้ดอาจจะไม่สามารถใช้งานได้แล้วหรือโค้ดที่คุณเพิ่มไม่ถูกต้อง',
    canUseCode: 'โค้ดของคุณสามารถใช้งานได้',
    usedCode: 'โค้ดของคุณถูกใช้งานแล้ว',
    expireCode: 'โค้ดของคุณหมดอายุการใช้งานแล้ว',
    placeCode: 'กรุณาใส่โค้ดของคุณ',
  },
};

const dialogService = {
  agree_: 'ตกลง',
  problemTryagain: 'เกิดข้อผิดพลาด โปรดลองอีกครั้ง',
  recordNotsup: 'ระบบอัดเสียงไม่รองรับระบบปฏิบัติการ',
  welcomeword: 'ยินดีต้อนรับสู่ Botnoi Voice',
  receive: 'คุณได้รับ 500 PT',
  usedCode: 'คุณได้ทำการใช้โค้ดไปแล้ว',
  inviteCodeerr: 'โค้ดเชิญเพื่อนสามารถใช้ได้เพียงครั้งเดียวต่อหนึ่งแอคเคาท์',
  codeerr: 'ไม่สามารถใช้งานโค้ดได้',
  inviteCodeself: 'คุณไม่สามารถใช้โค้ดนี้เชิญตัวคุณเองได้',
  copy_: 'คัดลอกลิงค์เรียบร้อย',
};

const firebaseAuth: TFirebaseAuth = {
  signin_by: 'เข้าสู่ระบบด้วย',
  or: 'หรือ',
  sign_in: 'เข้าสู่ระบบ',
  no_account: 'ยังไม่มีบัญชี?',
  exist_account: 'มีบัญชีอยู่แล้ว?',
  sign_up: 'สมัครสมาชิก',
  email: 'อีเมล',
  password: 'รหัสผ่าน',
  confirm_password: 'ยืนยันรหัสผ่าน',
  sign_up_popup: {
    header: 'สร้างบัญชีสำเร็จ',
    text: 'โปรดตรวจสอบอีเมลของคุณ และกดปุ่มยืนยันบัญชีภายใน 7 วัน',
    send_at: 'ส่งไปที่ ',
    accept: 'เข้าใจแล้ว',
  },
  verify_popup: {
    header: 'ยืนยันอีเมลสำเร็จ',
    text: 'เริ่มต้นใช้งานกันเลย',
    accept: 'ไปยังหน้าเข้าสู่ระบบ',
  },
  options: {
    remember: 'จดจำรหัสผ่าน',
    forget_password: 'ลืมรหัสผ่าน',
    text: 'ลิงค์สำหรับเปลี่ยนรหัสผ่านถูกส่งให้คุณแล้ว โปรดตรวจสอบอีเมลของท่าน',
    reset_password: 'เปลี่ยนรหัสผ่าน',
    reset_password_complete: 'เปลี่ยนรหัสผ่านสำเร็จ',
    save: 'บันทึก',
  },
};

const campaign = {
  description1:
    'BOTNOI Voice เป็น AI ที่สามารถใช้แปลงข้อความเป็นเสียง เหมาะสำหรับครู อาจารย์ ที่จะนำไปใช้ทำสื่อการเรียนการสอน ทีมงาน BOTNOI เล็งเห็นความสำคัญในการสร้าง',
  description2:
    'สื่อการเรียนการสอนยุคใหม่ จึงจัดตั้งโครงการนี้ขึ้นเพื่อให้ครูอาจารย์ได้ใช้ AI นี้ในการทำสื่อการเรียนการสอน',
  rules: 'กติกาในการเข้าร่วม',
  seemoreWorkshop: 'สามารถดูผลงานตัวอย่าง ได้ที่',
  textli: [
    'Point เริ่มต้นเมื่อสมัคร = 100 points',
    'เมื่อเข้ากลุ่มและกรอกข้อมูลแล้ว ทุกวันระบบจะทำการเช็ค ถ้า Point ต่ำกว่า 500 points ระบบจะเติมให้อัตโนมัติ +10,000 points',
    'ครูอาจารย์ที่มี account อยู่แล้วและมี point มากกว่า 500, เมื่อ point ต่ำกว่า 500 pts, ระบบจะทำการเติมให้',
    'เมื่อทำคลิปวิดีโอลงบน Social รบกวนติด #BotnoiVoice #teacherXbotnoivoice',
    'ผลงานใครน่าสนใจลุ้นเป็น Partner กับทางบอทน้อย!',
  ],
  conditionTopic: 'เงื่อนไขในการเข้าร่วม',
  warning:
    'Credit ที่ให้สำหรับการสร้างสื่อการเรียนการสอนเท่านั้น หากพบเจอว่านำไปใช้ทำอย่างอื่น ขอสงวนสิทธิ์ไม่ให้ Credit เพิ่ม',
  contact: [
    'หากคุณครูหรืออาจารย์ ท่านไหนสนใจสามารถกดลิงค์นี้ เพื่อเข้ากลุ่ม Open Chat  หรือ สแกน Qr Code ด้านล่าง',
    'ลิงค์เข้าร่วม',
  ],
};

const soundTest = {
  topic1: 'ทดลองฟังเสียงจากข้อความ',
  topic2: 'เสียงสังเคราะห์ AI พัฒนาโดยคนไทย',
  selectVoiceOver: 'เลือกเสียงพากย์',
  typeSomething: 'พิมพ์ข้อความ',
  errAlert: 'ไม่สามารถเล่นเสียงได้ โปรดลองใหม่อีกครั้ง',
  listening: 'ฟังเสียง',
};

const popupObj = [
  {
    title: 'ส่งคำขอเบิกถอนเงินของคุณสำเร็จแล้ว',
    detail: 'ระบบจะโอนเงินให้คุณใช้เวลาไม่เกิน 14 วันทำการ นับจากสิ้นเดือนนั้น',
    buttonInfo: 'ปิดหน้าต่างนี้',
  },
  {
    title: 'คำขอกำลังดำเนินการ',
    detail: 'เราได้รับคำขอของท่านแล้วและกำลังอยู่ระหว่างการดำเนินการ',
    buttonInfo: 'ปิดหน้าต่างนี้',
  },
  {
    header: 'ต้องการส่งคำขอเบิกเงินใช่หรือไม่',
    details: '',
    cancel: 'ยกเลิก',
    confirm: 'ตกลง',
  },
];

const agreement = {
  callback: 'ย้อนกลับไปหน้าแรก',
  agreeCondiotion: 'ข้อตกลงและเงื่อนไขการใช้งานเว็บไซต์',
  cancel_: 'ยกเลิก',
  accept_: 'ยอมรับ',
  title_delete_fb: 'ลบบัญชี',
  delete_fb: 'ยืนยันการลบบัญชี',
  confirm_dialog: {
    title: 'ลบบัญชี',
    label: `กรอกคำว่า "ฉันยืนยันในการลบบัญชีนี้"`,
    btn: 'ตกลง',
    confirm_text: 'ฉันยืนยันในการลบบัญชีนี้',
  },
  agreementAccept:
    'ฉันได้อ่านและยอมรับข้อตกลงการใช้งานและเงื่อนไข นโยบายความเป็นส่วนตัวดังกล่าว',
  description: {
    description1:
      'การเข้าเว็บไซต์นี้ ตลอดจนการเปิดหน้าเว็บต่าง ๆ ที่อยู่ในเว็บไซต์นี้ผู้ใช้งานเว็บไซต์ (“ผู้ใช้งาน”)ตกลงและยินยอมที่จะปฏิบัติตามนโยบายของกลุ่มบริษัทบอทน้อย(“บอทน้อยกรุ๊ป”) กฎหมายที่ใช้บังคับและข้อตกลงและเงื่อนไขการใช้งานเว็บไซต์ที่กำหนดไว้ในข้อตกลงนี้ทั้งที่กำหนดไว้เป็นการทั่วไปและที่ได้กำหนดไว้โดยเฉพาะเจาะจงในส่วนใดส่วนหนึ่งของเว็บไซต์นี้ทั้งหมด(“ข้อตกลงและเงื่อนไขการใช้”)โดยผู้ใช้งานรับทราบและตกลงว่าข้อตกลงและเงื่อนไขการใช้ที่กำหนดไว้นั้นอาจมีการเปลี่ยนแปลงได้โดยไม่ต้องมีการบอกกล่าวล่วงหน้า',
    description2:
      'อย่างไรก็ดี การเปลี่ยนแปลงใด ๆที่เกี่ยวกับข้อตกลงและเงื่อนไขการใช้จะมีการเผยแพร่ไว้ในเว็บไซต์นี้และเมื่อผู้ใช้งานได้เข้าใช้งานเว็บไซต์นี้ภายหลังการเปลี่ยนแปลงดังกล่าวแล้วย่อมถือว่าผู้ใช้งานตกลงยอมรับข้อตกลงและเงื่อนไขการใช้ทั้งหมดตามที่ได้เปลี่ยนแปลงแล้วดังนั้นผู้ใช้งานจึงควรติดตามข้อตกลงและเงื่อนไขการใช้งานเว็บไซต์ที่กำหนดไว้นี้อยู่เสมอ',
    description3:
      'ทั้งนี้ หากท่านไม่เห็นด้วยหรือประสงค์ที่จะปฏิเสธความมีผลผูกพันตามข้อตกลงและเงื่อนไขการใช้ใด ๆ ขอความกรุณาท่านยุติการเข้าชมและใช้งานเว็บไซต์นี้',
  },
  titlewithDescrip: [
    {
      title: '1. การใช้เว็บไซต์และทรัพย์สินทางปัญญา',
      description: [
        '1.1 บรรดาข้อมูลที่ปรากฏในเว็บไซต์นี้ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะ ข้อความรูปภาพ เครื่องหมายการค้า กราฟิกต่าง ๆ เสียง การออกแบบหน้าจอแอปพลิเคชันการออกแบบส่วนต่อประสานกับผู้ใช้ (Interface) ข้อมูลต่าง ๆไม่ว่าจะอยู่ในรูปแบบใด โปรแกรมซอฟท์แวร์ใด ๆ ที่มีอยู่ในเว็บไซต์นี้รวมถึงข้อมูลทั้งหลายที่ผู้ใช้งานได้ดาวน์โหลดจากเว็บไซต์นี้(ซึ่งต่อไปนี้จะรวมเรียกว่า “เนื้อหา”) ถือเป็นสิทธิของบอทน้อยกรุ๊ปหรือผู้ให้อนุญาตแก่บอทน้อยกรุ๊ปซึ่งเนื้อหาเหล่านั้นได้รับความคุ้มครองด้านทรัพย์สินทางปัญญาและ/หรือสิทธิในความเป็นเจ้าของอื่น ๆตามกฎหมายของประเทศไทยและ/หรือกฎหมายของประเทศอื่นไม่ว่าในรูปแบบใด ๆและไม่ว่าจะได้รับการจดทะเบียนไว้แล้วหรือไม่ก็ตาม',
        'ทั้งนี้ การนำชื่อทางการค้า เครื่องหมายการค้า เครื่องหมายบริการและเครื่องหมายอื่น ๆ ของบอทน้อยกรุ๊ป รวมถึงทรัพย์สินทางปัญญาใด ๆที่ปรากฏในเว็บไซต์นี้ไปใช้ ไม่ว่าจะด้วยวัตถุประสงค์ใด ๆผู้ใช้งานจะต้องได้รับความยินยอมล่วงหน้าเป็นลายลักษณ์อักษรจากบอทน้อยกรุ๊ปก่อนดำเนินการ',
        '1.2 บรรดาชื่อทางการค้า ชื่อสินค้า เครื่องหมายการค้า เครื่องหมายบริการและเครื่องหมายอื่น ๆรวมถึงทรัพย์สินทางปัญญาอื่นใดที่ปรากฏในเว็บไซต์นี้นอกเหนือจากสิ่งที่เป็นทรัพย์สินทางปัญญาของบอทน้อย กรุ๊ปซึ่งได้ถูกนำมาเรียบเรียงหรือจัดให้มีขึ้นเพื่อใช้เป็นส่วนประกอบของเว็บไซต์นี้มีขึ้นเพื่อวัตถุประสงค์ในการตกแต่งรูปลักษณ์ของเว็บไซต์โดยบอทน้อยกรุ๊ปในฐานะผู้ให้บริการเว็บไซต์ไม่ได้มีเจตนาที่จะกระทำการใดๆ อันเป็นการละเมิดสิทธิในทางการค้าหรือทรัพย์สินทางปัญญาของผู้ใดเว้นแต่มีข้อความระบุไว้เป็นอย่างอื่นในเว็บไซต์นี้',
      ],
    },
    {
      title: '2.การตกลงยอมรับข้อกำหนดและเงื่อนไขฯ ฉบับนี้',
      description: [
        '2.1. ผู้ใช้งานทุกรายจะต้องใช้บริการฯตามข้อกำหนดที่ระบุไว้ในข้อกำหนดและเงื่อนไขฯ ฉบับนี้โดยผู้ใช้งานจะไม่สามารถใช้บริการฯได้เว้นเสียแต่ผู้ใช้งานได้ตกลงยอมรับข้อกำหนดและเงื่อนไขฯ ฉบับนี้แล้ว',
        '2.2. ผู้ใช้งานซึ่งเป็นผู้เยาว์จะสามารถใช้บริการฯได้ก็ต่อเมื่อได้รับความยินยอมล่วงหน้าจากบิดามารดาหรือผู้แทนโดยชอบกฎหมายเท่านั้นนอกจากนี้ หากผู้ใช้งานดังกล่าวใช้บริการฯในนามหรือเพื่อวัตถุประสงค์ขององค์กรธุรกิจใดให้ถือว่าองค์กรธุรกิจดังกล่าวได้ตกลงยอมรับข้อกำหนดและเงื่อนไขฯฉบับนี้แล้วล่วงหน้า',
        '2.3. หากมีข้อกำหนดและเงื่อนไขฯ เพิ่มเติมใดๆซึ่งเกี่ยวข้องกับการให้บริการฯผู้ใช้งานจะต้องปฏิบัติตามข้อกำหนดและเงื่อนไขฯเพิ่มเติมดังกล่าวเช่นเดียวกับข้อกำหนดและเงื่อนไขฯ ในการใช้งานฉบับนี้',
      ],
    },
    {
      title: '3. ข้อสงวนสิทธิ์และข้อจำกัดความรับผิด',
      description: [
        '3.1 เว็บไซต์นี้ เป็นเว็บไซต์เพื่อการใช้งาน Speech Synthetic ผู้ใช้งานจะต้องไม่นำเสียงที่ได้จากระบบของเว็บไซต์ ไปใช้งานในทางเสียหาย เสื่อมเสีย ละเมิดลิขสิทธิ์ทางปัญญา หรือละเมิดกฎหมายใด ๆ ก็ตาม หากผู้ใช้งานนำเนื้อหาบนเว็บไซต์ไปใช้งานในทางผิดกฎหมาย ละเมิดสิทธิส่วนบุคคล หรือละเมิดทรัพย์สินทางปัญญา ผู้ใช้งานจะต้องเป็นผู้รับผิดชอบต่อผลทางกฎหมายทั้งหมด แต่เพียงผู้เดียว',
        '3.2 บอทน้อยกรุ๊ปสงวนสิทธิ์ในการพิจารณาไม่อนุญาตให้ผู้ใช้งานใช้งานเว็บไซต์นี้รวมถึงสงวนสิทธิ์ในการเปลี่ยนแปลงหรือระงับการให้บริการเว็บไซต์ไม่ว่าบางส่วนหรือทั้งหมดและไม่ว่าในเวลาใดๆ แก่ผู้ใช้งานโดยไม่จำเป็นต้องบอกกล่าวล่วงหน้าหรือระบุเหตุผลในการดำเนินการนั้น',
        '3.3 บอทน้อยกรุ๊ปไม่อาจรับรองว่าบรรดาโฆษณาที่อยู่บนเว็บไซต์นี้ (ถ้ามี) มีความถูกต้อง สมบูรณ์ และปราศจากข้อบกพร่องใด ๆ โดยบอทน้อยกรุ๊ปเป็นเพียงสื่อกลางในการส่งผ่านข้อมูลการโฆษณาเท่านั้น และไม่ใช่ตัวแทน หุ้นส่วน หรือมีนิติสัมพันธ์ใด ๆ กับเจ้าของโฆษณาซึ่งปรากฏอยู่บนเว็บไซต์นี้ ไม่สามารถตรวจสอบ หรือทราบถึงแหล่งที่มาและ/หรือรายละเอียดของโฆษณาทั้งหมดที่ปรากฏในเว็บไซต์นี้ได้ ทั้งนี้ หากการนำเสนอโฆษณาดังกล่าวก่อให้เกิดความสูญหายหรือความเสียหายแก่ผู้ใช้งาน บอทน้อยกรุ๊ปปฏิเสธความรับผิดและภาระผูกพันทางกฎหมายทุกกรณี',
        '3.4 นอกเหนือจากที่กำหนดไว้ในข้อตกลงและเงื่อนไขการใช้นี้ บอทน้อยกรุ๊ป กรรมการ ผู้จัดการ ผู้บริหาร พนักงาน ลูกจ้าง ตัวแทน หรือที่ปรึกษาของบอทน้อยกรุ๊ป จะไม่รับผิดในความผิดพลาด หรือความบกพร่องใด ๆ ของเว็บไซต์ หรือจากข้อมูล เนื้อหาที่ปรากฏในเว็บไซต์ ตลอดจนไม่รับผิดในผลของการละเว้นการกระทำใด ๆ ที่เกี่ยวข้องกับเว็บไซต์นี้ ไม่ว่าจะเกิดจากสัญญา ละเมิด ประมาท หรือเหตุอื่นใดที่อาจจะเกิดขึ้น ถึงแม้ว่าบอทน้อยกรุ๊ปจะได้รับแจ้งว่าอาจจะเกิดความเสียหายดังกล่าวขึ้นได้ก็ตาม',
      ],
    },
    {
      title:
        '4. การชดเชยค่าเสียหาย หากมีผู้ใช้งานละเมิดข้อตกลงในการใช้บริการตามที่บ ระบุไว้ และสร้างความเสียหายในทางใดต่อบอทน้อยกรุ๊ป ทางบอทน้อยกรุ๊ป ขอสงวนสิทธิ์ในการเรียกร้องค่าเสียหายจากผู้ใช้นั้น',
    },
    {
      title:
        '5.ผู้ให้บริการภายนอก การให้บริการฯ นี้อาจมีเนื้อหาฯ หรือบริการอื่นใดซึ่งให้บริการหรือจัดทำโดยผู้ให้บริการภายนอก ในการนี้ผู้ให้บริการภายนอกดังกล่าวจะเป็นผู้รับผิดชอบแต่เพียงผู้เดียวเกี่ยวกับเนื้อหาฯ และ/หรือการให้บริการดังกล่าว นอกจากนี้ เนื้อหาฯ หรือบริการฯ ดังกล่าวอาจตกอยู่ภายใต้ข้อกำหนด การใช้ หรือข้อกำหนดและเงื่อนไขอื่นใดซึ่งผู้ให้บริการภายนอกได้กำหนดไว้สำหรับเนื้อหาและบริการนั้นๆ',
    },
    {
      title:
        '6. นโยบายการรักษาความมั่นคงปลอดภัยของเว็บไซต์ บอทน้อยกรุ๊ปได้เลือกใช้เทคโนโลยี มาตรการรักษาความมั่นคงปลอดภัยในการทำธุรกรรมบนเครือข่ายอินเทอร์เน็ต เพื่อป้องกันข้อมูลของผู้ใช้งานในระหว่างการส่งข้อมูลผ่านเครือข่ายการสื่อสาร หรือจากการถูกโจรกรรมข้อมูลโดยบุคคลหรือเครือข่ายอื่นทุกระบบที่ไม่ได้รับอนุญาตเข้ามาเชื่อมต่อกับเครือข่ายของบอทน้อยกรุ๊ป เช่น Firewall และการเข้ารหัสแบบ Secured Socket Layer (SSL) เป็นต้น',
    },
    {
      title:
        '7. กฎหมายที่บังคับใช้ ข้อตกลงและเงื่อนไขการการใช้งานเว็บไซต์นี้อยู่ภายใต้บังคับแห่งกฎหมายไทย',
    },
  ],
};

const blacklist = {
  title1: 'บัญชีของคุณอยู่ใน Blacklist',
  title2: 'หากมีข้อสงสัย กรุณาติดต่อเรา',
};

const longword = {
  mainSelection: 'เกิน x ตัวอักษรที่กำหนดไว้',
  subSelection: 'กรุณาแบ่งข้อความที่ต้องการคลุมไปใช้ในประโยคถัดไป',
  mainLongword: 'พิมพ์คำอ่านเกิน x ตัวอักษรแล้ว',
  subLongword: 'เวลาในการสร้างเสียงจะมากขึ้นเมื่อตัวอักษรมีมากเกินไป',
};

const audio = {
  removeAudio: {
    acceptDeleted: 'ยืนยันการลบไฟล์เสียง',
    deleteSeleted: 'คุณต้องการลบรายการที่เลือกไว้',
    confirm: 'ใช่หรือไม่',
    cancel_: 'ยกเลิก',
    accept_: 'ยืนยัน',
    count: 'รายการ',
  },
  upgradeAudio: {
    planPackage: {
      package: 'แพ็กเกจพื้นที่เก็บข้อมูลคลังเสียง',
      detail: 'ลดราคาสูงสุดถึง 16.67% เฉพาะซื้อแพ็คเกจรายปีเท่านั้น!',
    },
  },
};

const storage = {
  studio: 'คลังเสียงของฉัน',
  storageText: 'พื้นที่เก็บข้อมูล',
  usede: 'ใช้ไปแล้ว',
  from: 'จาก',
  allsoundFile: 'ไฟล์เสียงทั้งหมด',
  searchSound: 'ค้นหาไฟล์เสียง',
  page_: 'หน้า',
  text_: 'ดูข้อความ',
  upload: 'อัปโหลด',
  seletedPage: 'เลือกทั้งหมด (หน้า',
  deleteSelected: 'ล้างตัวเลือก',
  downloadSoundfile: 'ดาวน์โหลดไฟล์เสียง',
  download_: 'ดาวน์โหลด',
  deleteSoundfile: 'ลบไฟล์เสียง',
  delete_: 'ลบทิ้ง',
  removeAll: 'ลบทั้งหมดในคลัง',
  downloading: 'กำลังอัปโหลดไฟล์',
  sucessfulDownload: 'อัปโหลดไฟล์สำเร็จ',
  copycomplete: 'คัดลอกลิงค์เรียบร้อย',
  copytoclipboard: 'คัดลอกข้อความไปยังคลิปบอร์ดเรียบร้อย',
  successfulDownloadsound: 'ดาวน์โหลดเสียงเรียบร้อย',
  successfulDeletesound: 'ลบไฟล์เสียงเรียบร้อย',
  successdeleteSoundfile: 'ลบไฟล์เสียงเรียบร้อย',
  successdeleteAllsoundfile: 'ลบไฟล์เสียงทั้งหมดเรียบร้อย',
  tooltip: [
    'คัดลอกข้อความไปยังคลิปบอร์ด',
    'ดาวน์โหลดเสียง',
    'คัดลอกลิงค์',
    'แชร์เสียง',
    'ลบไฟล์เสียง',
  ],
};

const workspace = {
  projectAuto: 'โปรเจค',
  createProject: 'สร้างโปรเจคใหม่',
  insertImage: 'เปลี่ยนรูปภาพ',
  projectName: 'ชื่อโปรเจค',
  placeholder: 'โปรเจคใหม่',
  type: 'ประเภท',
  createBook: 'สร้างบทความ',
  createConversation: 'สร้างบทสนทนา',
  cancel: 'ยกเลิก',
  submit: 'สร้าง',
  project: 'โปรเจคของฉัน',
  editProject: 'แก้ไขโปรเจค',
  lastChange: {
    update: 'แก้ไข',
    ago: 'ที่ผ่านมา',
  },
  recentProject: 'โปรเจคล่าสุด',
  changeName: 'แก้ไขชื่อ',
  changeImage: 'เปลี่ยนภาพ',
  deleteProject: 'ลบโปรเจค',
  alert: {
    size: 'ขนาดไฟล์เกิน 2 Mb',
    type: 'กรุณาใช้ประเภทไฟล์ที่รองรับ (jpg,jpeg,png,webp)',
    img: 'กรุณาเปลี่ยนรูป',
    max: 'พื้นที่เก็บโปรเจคเต็ม',
    duplicate: 'ชื่อโปรเจคไม่สามารถซ้ำกันได้',
    sameName: 'กรุณาใช้ชื่อโปรเจคใหม่',
    blank: 'กรุณาใส่ชื่อโปรเจค',
  },
  deleteAlert: 'คุณต้องการลบโปรคเจคนี้หรือไม่',
  confirm: 'ตกลง',
  timeUnit: {
    hour: 'ชั่วโมง',
    day: 'วัน',
    week: 'อาทิตย์',
    month: 'เดือน',
    year: 'ปี',
  },
  alertDialog: [
    {
      header: 'คุณสร้างโปรเจ็กต์ครบจำนวนที่จำกัดแล้ว',
      details:
        'ต้องการอัปเกรดแพ็คเกจของคุณเพื่อสร้างโปรเจ็กต์ ได้เพิ่มมากขึ้นหรือไม่',
      cancel: 'ไม่ต้องการ',
      confirm: 'ต้องการ',
    },
    {
      header_edit: 'แก้ไขชื่อโปรเจกต์',
      header_create: 'ตั้งชื่อโปรเจกต์',
      input_text: 'พิมพ์ข้อความเพื่อสร้างเสียง',
      alert: 'ชื่อไม่สามารถเกิน 25 ตัวอักษรได้',
      cancel: 'ยกเลิก',
      confirm: 'บันทึก',
    },
    {
      header: 'เปลี่ยนภาพโปรเจกต์',
      insertImage: 'เปลี่ยนภาพ',
      cancel: 'ยกเลิก',
      confirm: 'บันทึก',
      sizeExceed: 'ขนาดไฟล์รูปไม่สามารถเกิน 10 MB',
      invalidType: 'ประเภทไฟล์ไม่รองรับ',
    },
    {
      header: 'ลบโปรเจกต์',
      details:
        'คุณจะไม่สามารถกลับใช้งานโปรเจ็กต์นี้ได้อีก คุณยืนยันที่จะลบโปรเจ็กต์นี้ใช่หรือไม่',
      cancel: 'ยกเลิก',
      confirm: 'ยืนยัน',
    },
  ],
};

const subscription = {
  title: ' แพ็คเสริม',
  sub_title: 'ปลดล็อคขีดจำกัดด้วยแพ็คเสริม ราคาพิเศษสุดคุ้ม',
  currency: currency,
  month: 'เดือน',
  year: 'ปี',
  character: 'ตัวอักษร',
  time: 'ครั้ง',
  free_price: 'ทดลองใช้งาน',
  free_try: 'ทดลองใช้งานฟรี',
  already_try: 'ใช้งานแพ็คเกจแล้ว',
  compensate_price: 'สิทธิพิเศษใช้ฟรี 1 ปี',
  special: ['พิเศษ! ลดราคาจนถึง', 'นี้ เท่านั้น'],
  discount_box: ['ลด ', '%'],
  expire_at: 'หมดอายุวันที่ ',
  remaining_days: ['เหลืออีก ', ' วัน'],
  renew: 'ต่ออายุ',
  faq_title: 'คำถามที่พบบ่อย',
  faq: [
    {
      question: 'ฉันสามารถทดลองใช้ Botnoi voice ก่อนชำระเงินได้หรือไม่?',
      answer: 'สามารถทำได้',
    },
    {
      question: 'รองรับวิธีการชำระเงินแบบใดบ้าง?',
      answer: 'เรารองรับการชำระเงินผ่านบัตรเดบิต เครดิต และพร้อมเพย์',
    },
    {
      question: 'ฉันสามารถยกเลิกแพ็คเกจเสริมของฉันได้ตลอดเวลาหรือไม่? ',
      answer:
        'ใช่ คุณสามารถยกเลิกแพ็คเกจเสริมของคุณได้ตลอดเวลา ในการยกเลิกจะถูกยกเลิกในรอบบิลถัดไป',
    },
    {
      question: 'ขอใบกำกับภาษีได้ไหม?',
      answer:
        'สำหรับลูกค้าที่ต้องการใบกำกับภาษีเต็มรูปแบบ สามารถแจ้งขอพร้อมแนบหลักฐานการชำระเงินได้ที่อีเมล admin@botnoigroup.com',
    },
  ],
  discount: {
    title: 'ลด 30%!',
    content: 'ภายในวันที่ 31 สิงหาคม 2566',
  },
  yearly: ['990 บาท/ปี', '4,990 บาท/ปี', '9,990 บาท/ปี', '100,000 บาท/ปี'],
  ads: {
    title: 'แพ็คเกจ',
    for: 'สำหรับองค์กร',
    info: 'For advanced security and more flexible controls, the Enterprise plan helps you scale design processes company-wide.',
  },
  upgrade: 'อัปเกรด',
  downgrade: 'ดาวน์เกรด',
  cancel: 'ยกเลิกแพ็คเกจ',
  current: 'แพ็คเกจปัจจุบัน',
  contact: 'ติดต่อเรา',
  toggle_text: ['รายวัน', 'รายเดือน', 'รายปี'],
  discount_text: 'ลดพิเศษ',
  mock_text: {
    monthly_point: {
      number: '0',
      text: 'พ้อยท์ ดาวน์โหลดรายเดือน',
      type: 'monthly',
    },
    text_limit: {
      number: '0',
      text: 'ตัวอักษร สำหรับสร้างเสียง/ครั้ง',
      type: 'limit',
    },
    play_quota: {
      number: '0',
      text: 'ตัวอักษร สำหรับสร้างเสียง/วัน',
      type: 'play',
    },
    storage: {
      number: '0',
      text: 'MB พื้นที่คลังเสียง',
      type: 'storage',
    },
    point_discount_percent: {
      number: '0',
      text: 'ส่วนลดในการซื้อพ้อยท์',
      type: 'discount',
    },
    no_storage: {
      text: 'ดาวน์โหลดเสียงได้ไม่จำกัด',
      type: 'monthly',
    },
    only_platform: {
      number: 'สร้างเสียง',
      text: ' ได้เฉพาะบนแพลตฟอร์มเท่านั้น',
      type: 'platform',
    },
  },
  change_package: {
    title: 'เปลี่ยนแพ็คเกจ',
    text: 'ก่อนที่จะเปลี่ยนแพ็คเกจจำเป็นต้องยกเลิกแพ็คเกจเดิม ต้องการที่ยกเลิกหรือไม่',
    yes: 'ตกลง',
    no: 'ยกเลิก',
    complete: 'เปลี่ยนแพ็คเกจสำเร็จ',
  },
  tier: {
    point_discount: 'ซื้อพ้อยท์ถูกลง',
    buy_discount: 'ซื้อพ้อยท์',
    discount: 'ถูกลง',
    discount_suffix: '',
    noads: 'ไม่มีโฆษณารบกวน',
    limit_text: 'สร้างเสียงได้ 2,000 ตัวอักษร/กล่องเสียง',
    storage_front: 'จัดเก็บไฟล์เสียงได้เพิ่มขึ้น',
    storage_back: ' เท่า',
    limit: 'สร้างเสียงได้',
    sign_up: 'สมัคร',
    disable_text: 'เป็นสมาชิกแล้ว',
  },
};
const importexport = {
  importFile: 'นำไฟล์เข้า',
  supportFile: 'รองรับไฟล์ประเภท .csv',
  templateCSV: 'ดาวน์โหลด template.csv',
  templateXLSX: 'ดาวน์โหลด template.xlsx',
  sampleFile: 'ตัวอย่างไฟล์',
  cancel: 'ยกเลิก',
  selectFile: 'เลือกไฟล์',
  uploadSuccess: 'อัปโหลดไฟล์สำเร็จ',
  confirm: 'ยืนยัน',
  uploadFailed: 'อัปโหลดไฟล์ล้มเหลว',
  selectAgain: 'กรุณาเลือกไฟล์อีกครั้ง',
  exportFile: 'นำไฟล์ออก',
  selectType: 'เลือกประเภทไฟล์',
  exportConfirm: 'นำออก',
};

const leaveAlert = {
  confirmAlert: 'กรุณายืนยัน',
  leaving: 'คุณกำลังออกจากหน้านี้',
  askSave: 'คุณต้องการบันทึกข้อมูลก่อนหรือไม่ ?',
  cancel: 'ยกเลิก',
  confirm: 'บันทึกและออก',
  free: {
    header: 'คุณกำลังออกจากหน้านี้',
    details_1:
      'เนื่องจากแพ็คเกจปัจจุบันของท่านคือ Free ทำให้ไม่สามารถบันทึกงานได้ คุณแน่ใจว่าต้องการออกจากหน้านี้หรือไม่ ?',
    cancel: 'เข้าใจแล้ว',
    confirm: 'ออก',
  },
};

const userObj = {
  list: ['โปรไฟล์', 'แพ็คเกจของฉัน'],
  profile: {
    title: 'ข้อมูลติดต่อ',
    username: 'Username',
    email: 'Email',

    uid: 'UID',
    copy: 'คัดลอก',
    done: 'คัดลอกสำเร็จ',
    upgrade: {
      title: 'พื้นที่จัดเก็บคลังเสียง',
    },
    speaker: {
      header: ['pulse', 'star'],
      header_text: ['เสียง AI', 'รีวิว'],
      toggle: 0,
      noSpeaker: 'เปิดให้บริการสร้างเสียง AI เร็วๆ นี้',
    },
  },
  subscription: {
    title: 'แพ็คเกจของฉัน',
    package: 'การเป็นสมาชิก',
    price: 'ราคา',
    status: 'ใช้งานได้ถึง',
    expire: 'ต่ออายุอัตโนมัติ ',
    debit: ['ปิดใช้งาน', 'หักเงินอัตโนมัติ'],
    member: 'สมาชิก',
    general_member: 'สมาชิกทั่วไป',
    free: 'ใช้งานฟรี',
    upgrade: 'อัปเกรด',
    cancel: 'ยกเลิกการเป็นสมาชิก',
    currency: ' บาท',
    period: {
      0: 'วัน',
      1: 'เดือน',
      12: 'ปี',
    },
    date: 'วันที่',
    time: {
      expire: ' น.',
      renew: ' น.',
    },
    warning: {
      title: 'แจ้งเตือน',
      content:
        'ระบบจะทำการหักเงินอัตโนมัติเพื่อต่ออายุการงใช้งาน หากไม่ต้องการต่ออายุการใช้งาน ให้ผู้ใช้ทำการกดปุ่ม “ยกเลิกการเป็นสมาชิก” ด้านล่างนี้',
    },
    cancel_package: {
      title: 'ยกเลิกการเป็นสมาชิก',
      content: [
        'คุณจะสามารถใช้สิทธิการเป็นสมาชิก ได้จนถึง ',
        ' คุณต้องการที่จะยกเลิกการเป็นสมาชิกนี้ใช่หรือไม่?',
      ],
      btn: 'ยกเลิกการเป็นสมาชิก',
    },
    box2: {
      title: 'สิทธิที่ได้รับ',
      advantages: {
        daily_point: '<b>ฟรี {x} </b>พ้อยท์/วัน',
        monthly_point: '<b>ฟรี {x} </b>พ้อยท์/เดือน',
        play_quota: 'โควต้าการเล่นเสียง <b> {x} </b> ตัวอักษร/วัน',
        // thb_per_point: 'พ้อยท์ราคา <b> {x} </b> บาท/พ้อยท์',
        text_limit: 'พิมพ์ข้อความ <b> {x} </b> ตัวอักษร/กล่อง',
        workspace: 'สร้างได้ <b> {x} </b> โปรเจค',
        download: 'ดาวน์โหลดเสียง <b> {x} </b>',
        text: 'ไม่จำกัด',
      },
    },
    cancel_status: 'ยกเลิกการเป็นสมาชิกสำเร็จ',
  },
};

const newsObj = {
  title: 'ประกาศ',
  ask: ['ไม่แสดงอีกใน ', ' วัน'],
  btn: 'ดูรายละเอียด',
};

const historyAlert = {
  header: 'ยกเลิกการแก้ไขคำอ่าน',
  askDelete: 'ต้องการนำการแก้ไขคำอ่านออกหรือไม่ ?',
  cancel: 'ไม่ต้องการ',
  confirm: 'นำออก',
};

const quoteObj = {
  title: 'ราคา',
  ...usagePriceOnLandingPage,
  box3: {
    title: ['สนใจสั่งซื้อในราคาพิเศษ'],
    btn: 'ติดต่อ',
  },
};
const selectVoiceDialog = {
  header: 'เลือกเสียงพากย์',
  allVoice: 'เสียงทั้งหมด',
  favorite: 'รายการโปรด',
  lang: 'ภาษา',
  style: 'สไตล์',
  categories: 'หมวดหมู่',
  gender: 'เพศ/วัย',
  all: 'ทั้งหมด',
  popular: 'ยอดนิยม',
  new: 'มาใหม่',
  selectAll: 'เลือกทั้งหมด',
  useVoice: 'ใช้เสียงนี้',
  using: 'ใช้เสียงนี้อยู่',
  confirm: 'ตกลง',
  searchResult: 'ผลลัพธ์การค้นหา',
  resultAll: 'ทั้งหมด',
  resultList: 'รายการ',
  noResult: 'ไม่พบผลลัพธ์การค้นหา',
  try: 'ลองใช้คำค้นหาอื่น',
  alert: 'กรุณาเลือกเสียงพากย์',
  clear: 'ล้าง',
  addFav: 'เพิ่มในรายการโปรด',
  removeFav: 'เพิ่มในรายการโปรดแล้ว',
  tooltip: {
    playSound: 'ฟังเสียง',
    useVoice: 'ใช้เสียงนี้',
    addFav: 'เพิ่มเป็นรายการโปรด',
    removeFav: 'ลบจากรายการโปรด',
    next: 'หน้าต่อไป',
    previous: 'ย้อนกลับ',
    filter: 'ค้นหาอย่างละเอียด',
  },
  freeVoice: 'เสียงฟรี',
  favVoice: 'รายการโปรด',
  other: '+ อิ่นๆ',
  other_lang: 'ภาษาอื่นๆ ที่พูดได้',
  freeTag: 'ฟรี',
};

const patchNoteObj = {
  title: 'ข่าวดี',
  text: [
    'Botnoi Voice เปิดให้ใช้บริการสร้างเสียง ฟรี ได้แล้ววันนี้',
    'สำหรับผู้ใช้งานเก่าทุกคน จะได้รับสิทธิพิเศษใช้งานแพ็คเกจเบสิค ราคา 99 บาท/เดือน ฟรี!! 1 ปี พร้อมสิทธิประโยชน์ซื้อพ้อยท์ในราคาที่ถูกลง (สำหรับสิทธิพิเศษนี้จะไม่ได้รับพ้อยท์พิเศษ 5,000 พ้อยท์ / เดือน)',
    'ท่านสามารถดูรายละเอียดและสิทธิพิเศษของแต่ละแพ็คเกจเพิ่มเติมได้ที่ ดูแพ็คเกจทั้งหมด',
  ],
  checkbox: 'ไม่แสดงอีก',
};

const dialogPaid = {
  title: 'ชำระเงิน',
  order: 'รายการสั่งซื้อ',
  sales: {
    code: 'ใส่โค้ด',
    info: 'ใส่โค้ดจากกิจกรรมต่างๆ เพื่อรับพ้อยต์เพิ่มเติม (ไม่บังคับ)',
    warning: 'ไม่พบโค้ดนี้ในระบบ',
    confirm: 'ยืนยัน',
    valid: 'โค้ดถูกต้อง',
    inValid: 'ไม่พบโค้ดนี้ในระบบ',
    sellerStatus: 'คุณมี seller code',
  },
  metholdTitle: 'เลือกช่องทางการชำระเงิน',
  method: [
    {
      icon: 'qr_code',
      text: 'สแกน QR Code',
      type: 'promptpay',
      fee: 'ฟรี',
    },
    {
      icon: 'credit_card',
      text: 'บัตรเครดิต/เดบิต',
      type: 'card',
      fee: 'มีค่าดำเนินการ',
    },
  ],
  auto_credit: 'ระบบจะตัดเงินอัตโนมัติทุกเดือน หากชำระด้วยบัตรเครดิต/เดบิต',
  fee: 'ค่าดำเนินการ',
  codePoint: 'ใช้โค้ดได้พ้อยท์เพิ่ม',
  totalPoint: 'พ้อยท์ทั้งหมดที่ได้รับ',
  total: 'ยอดที่ต้องชำระ',
  currency: currency,
  point: 'พ้อยท์',
  period: {
    0: 'วัน',
    1: 'เดือน',
    12: 'ปี',
  },
  cancel: 'ยกเลิก',
  confirm: 'ยืนยันการซื้อ',
  step2: {
    title: 'สแกน QR code ด้วย Mobile Banking',
    info: 'กรุณาเปิดหน้าต่างนี้ไว้จนกว่าระบบจะ แสดงหน้าต่างการชำระเงินสำเร็จ',
    cancel: 'ยกเลิก',
  },
  free_gift: ['แถมฟรี ', ' เดือน'],
  purchaseAllPoints: 'ซื้อพ้อยท์ทั้งหมด',
  productCost: 'ค่าสินค้า',
  shortTotalPoint: 'รวมพ้อยท์',
  removeCode: 'ลบโค้ด',
  hotPromotion: 'โปรโมชันสุดฮอต',
  hotPromotionDescription: 'รับพ้อยท์เพิ่ม 30% กดเลย',
  hotPromotionPrice: 'ราคาโปรโมชันสุดฮอต',
};
const marketplace_v2_Obj = {
  header: 'เลือกเสียงพากย์',
  allVoice: 'เสียงทั้งหมด',
  favorite: 'รายการโปรด',
  lang: 'ภาษา',
  style: 'สไตล์',
  categories: 'หมวดหมู่',
  gender: 'เพศ',
  all: 'ทั้งหมด',
  popular: 'ยอดนิยม',
  new: 'มาใหม่',
  selectAll: 'เลือกทั้งหมด',
  useVoice: 'ใช้เสียงนี้',
  using: 'ใช้เสียงนี้อยู่',
  confirm: 'ตกลง',
  searchResult: 'ผลลัพธ์การค้นหา',
  resultAll: 'ทั้งหมด',
  resultList: 'รายการ',
  noResult: 'ไม่พบผลลัพธ์การค้นหา',
  try: 'ลองใช้คำค้นหาอื่น',
  alert: 'กรุณาเลือกเสียงพากย์',
  clear: 'ล้าง',
};

const quotaDialog = {
  header: 'โควต้าเล่นเสียงประจำวันถึงขีดจำกัด',
  detail:
    'จำนวนโควต้าเล่นเสียงประจำวันถึงขีดจำกัดแล้วคุณสามารถดาวน์โหลดเสียง เพื่อรับโควต้าคืน หรือสมัครแพ็คเกจที่สูงขึ้นเพื่อรับจำนวนโควต้าที่มากขึ้น หรือรอ 24 ชม. เพื่อรีเซ็ตใหม่อีกครั้ง',
  understand: 'เข้าใจแล้ว',
  upgrade: 'อัปเกรด',
};

const maintenance = {
  title: 'ขณะนี้กำลังปรับปรุงเว็บไซต์',
  sub: 'ขออภัยในความไม่สะดวก ขณะนี้เว็บไซต์ของเราอยู่ระหว่างการบำรุงรักษาตั้งแต่เวลา 09:00 - 12:00 น.',
  footer: 'ขอขอบคุณที่ใช้บริการ',
};

const landingPageV3 = {
  hero: {
    header: 'ยินดีต้อนรับสู่ Botnoi Voice',
    header_1: 'สร้างพลังให้ ',
    header_2: 'แปลงข้อความ',
    header_3: 'เป็นเสียง',
    header_4: 'ด้วย ',
    header_5: 'BOTNOI',
    description:
      'เปลี่ยนทุกข้อความให้เป็นคำพูดที่เหมือนจริงได้อย่างง่ายดาย มีหลายภาษาให้เลือกใช้มากกว่า 10+ ภาษา ช่วยให้คุณทำงานได้อย่างราบรื่น ไม่ว่าจะเป็น ลงเสียง พากย์โฆษณา ทำสื่อการสอน อ่านข่าว อ่านสไลด์นำเสนอ พอดแคสต์ อ่านนิยาย จบงานง่าย ทำที่ไหนก็ได้',
    detail: '3 ขั้นตอนง่ายๆ',
    sub_detail: 'เลือกภาษาของคุณ',
    sub_detail_1: 'เลือกลักษณะเสียงของคุณ - ชาย | หญิง',
    sub_detail_2: 'พิมพ์ข้อความลงในกล่องข้อความและกดปุ่ม "สร้าง"',
    button: 'ใช้งานฟรี',
    ex_lang: 'ตัวอย่างเสียง : ',
    visit: 'จำนวนผู้ใช้งานบนเว็บไซต์',
    genvoice: 'จำนวนสร้างเสียง',
    try: 'ทดลองสร้างเสียง',
  },
  headerlanding: {
    headers: 'Botnoi Voice',
    subtitle: 'เสียง AI อันดับหนึ่งในไทย',
    detail:
      'ช่วยคุณเสร็จงานได้อย่างรวดเร็ว ทั้งทำคลิปสไลด์ อ่านข่าว ได้รับความเชื่อมั่นจากบริษัทชั้นนำของประเทศไทย',
    button: 'ใช้งานฟรี',
    visit: 'จำนวนผู้ใช้งานบนเว็บไซต์',
    genvoice: 'จำนวนสร้างเสียง',
    downloadCount: 'จำนวนดาวน์โหลดฟรีต่อวันของคุณ คงเหลือ 2 ครั้ง',
    limitdownlaod: 'คุณถึงขีดจำกัดการดาวน์โหลดฟรีต่อวันแล้ว',
    point: 'รับฟรี 100 พ้อยต์',
    newuser: 'สำหรับผู้ใช้ใหม่',
    buttondownload: 'สมัครใช้งานฟรี',
  },
  partner: {
    header: 'ได้รับความไว้วางใจจาก 1.5 ล้านผู้ใช้ทั่วโลก',
    header_2: 'ได้รับความไว้วางใจจากหลายองค์กร',
    header_card: 'จำนวนผู้ใช้งานเฉลี่ย',
    header_card2: 'จำนวนสร้างเสียงทั้งหมด',
    detail_card: '120,000 ผู้ใช้/เดือน',
    detail_card2: '15ล้าน+ ดาวน์โหลด',
    btn: 'ร่วมเป็นพาร์ทเนอร์ของเรา',
  },
  createSound: {
    header: 'ลองสร้างเสียงพากย์ในรูปแบบของคุณเอง',
    tabs: [
      'คนทำคอนเทนต์',
      'คุณครูและนักเรียน',
      'นักเขียนนิยาย',
      'คนทำพอร์ดแคส',
    ],
    detail: 'ลองสร้างเสียงของคุณ',
    placeholder: 'พิมพ์ข้อความตรงนี้',
  },
  customer: {
    text: 'ได้รับความไว้ใจจากหลายองค์กรที่ใช้งานแพลตฟอร์มของเรา',
  },
  news: {
    header: 'กิจกรรมและข่าวสาร',
  },
  result: {
    header: 'สร้างผลงานได้จริง',
    subtitle:
      'ผลงานจากการใช้ Botnoi Voice ที่ใช้สร้างเรื่องราวข่าวสาร สื่อการสอนและสาระบันเทิงอย่างมีคุณภาพ',
    card1: 'ใช้เสียงของBotnoi Voice สร้างสื่อออนไลน์บน Tiktok',
    card1_name: 'บอสขอนำเสนอ',
    card2: 'ใช้เสียงของBotnoi Voice สร้างสื่อการสอนออนไลน์',
    card2_name: 'ครูอภิวัฒน์ "สอนสร้างสื่อ"',
    card3: 'ใช้เสียงของBotnoi Voice สร้างสื่อออนไลน์บน Tiktok',
    card3_name: 'fictionfive11',
    button: 'ดูเพิ่มเติม',
  },
  compare: {
    pack: {
      basic: {
        name: 'Basic',
        price: '99',
        unit: 'บาท/เดือน',
        detail_1: 'แปลงข้อความ 1 A4 ได้ ≈ 3 แผ่น',
        detail_2: 'ทำคลิปสั้น 30 วิ ได้ ≈ 20 คลิป',
        detail_list: {
          row_1_num: 'ฟรี 5,000',
          row_1_text: 'พ้อยท์/เดือน',
          row_2_text_1: 'โควต้าการเล่นเสียง',
          row_2_num: '1,000 ',
          row_2_text_2: 'ตัวอักษร/วัน',
          row_3_text_1: 'พ้อยท์ราคา',
          row_3_num: '0.02',
          row_3_text_2: 'บาท/พ้อยท์',
          row_4_text_1: 'สร้างได้',
          row_4_num: '2',
          row_4_text_2: 'โปรเจค',
          row_5_text_1: 'พิมพ์ข้อความ ',
          row_5_num: '1,000',
          row_5_text_2: 'ตัวอักษร/กล่อง',
        },
      },
      advance: {
        name: 'Advance',
        price: '199',
        unit: 'บาท/เดือน',
        detail_1: 'แปลงข้อความ 1 A4 ได้ ≈ 12 แผ่น',
        detail_2: 'ทำคลิปสั้น 30 วิ ได้ ≈ 80 คลิป',
        detail_list: {
          row_1_num: 'ฟรี 20,000',
          row_1_text: 'พ้อยท์/เดือน',
          row_2_text_1: 'โควต้าการเล่นเสียง',
          row_2_num: '4,000 ',
          row_2_text_2: 'ตัวอักษร/วัน',
          row_3_text_1: 'พ้อยท์ราคา',
          row_3_num: '0.018',
          row_3_text_2: 'บาท/พ้อยท์',
          row_4_text_1: 'สร้างได้',
          row_4_num: '3',
          row_4_text_2: 'โปรเจค',
          row_5_text_1: 'พิมพ์ข้อความ ',
          row_5_num: '1,200',
          row_5_text_2: 'ตัวอักษร/กล่อง',
        },
      },
      pro: {
        name: 'Pro',
        price: '499',
        unit: 'บาท/เดือน',
        detail_1: 'แปลงข้อความ 1 A4 ได้ ≈ 37 แผ่น',
        detail_2: 'ทำคลิปสั้น 30 วิ ได้ ≈ 240 คลิป',
        detail_list: {
          row_1_num: 'ฟรี 60,000',
          row_1_text: 'พ้อยท์/เดือน',
          row_2_text_1: 'โควต้าการเล่นเสียง',
          row_2_num: '10,000 ',
          row_2_text_2: 'ตัวอักษร/วัน',
          row_3_text_1: 'พ้อยท์ราคา',
          row_3_num: '0.016',
          row_3_text_2: 'บาท/พ้อยท์',
          row_4_text_1: 'สร้างได้',
          row_4_num: '5',
          row_4_text_2: 'โปรเจค',
          row_5_text_1: 'พิมพ์ข้อความ ',
          row_5_num: '1,500',
          row_5_text_2: 'ตัวอักษร/กล่อง',
        },
      },
    },
    card_header: 'ยิ่งใช้มาก ยิ่งถูกมาก',
    card_detail:
      'มีหลายแพ็คเกจให้เลือกซื้อสำหรับใช้งานไม่ว่าจะใช้เป็นครั้งคราว ใช้ประจำ หรือใช้ไม่อั้น',
    card_btn: ['ซื้อเลย เริ่มต้นเพียง ', 99],
  },
  step: {
    header_1: 'เริ่มต้นใช้งานได้เลย ',
    header_2: 'เพียงแค่ 3 ขั้นตอน',
    card_1: 'พิมข้อความลงในช่อง',
    card_1_input: 'พิมพ์ข้อความเพื่อสร้างเสียง',
    card_2: 'ตั้งค่า เลือกภาษา เลือกเสียง',
    card_2_select_1: 'ภาษาไทย',
    card_2_select_2: 'เลือกเสียง',
    card_3: 'กดสร้างเสียงและดาวน์โหลด',
    card_3_text_1: '20 พ้อยท์',
    card_3_text_2: '≈ 1 บาท',
    card_3_button: 'ดาวน์โหลด',
    card_3_header_lang: 'มีเสียงให้เลือกถึง 10 ภาษา',
    card_3_sub_lang:
      'รวมเสียงพากย์ไทย อังกฤษ และภาษาเพื่อนบ้านอีกมากมาย ให้เลือกใช้รวมกันมากถึง 10 ภาษา',
    btn: 'เริ่มต้นใช้งาน',
  },
  feature: {
    header: 'ฟีเจอร์และอัพเดต',
    card_2_header: 'สร้างและบันทึกชิ้นงานได้ด้วยระบบ',
    card_2_sub: 'สตูดิโอ',
    card_2_btn: 'สร้างโปรเจคของคุณ',
    card_1_name: 'ทำงานได้รวดเร็วขึ้นด้วยระบบ',
    card_1_highlight: 'แก้ไขคำผิด',
  },
  card_list: {
    text_1: 'มีเสียง AI ให้ใช้ มากกว่า 100+ เสียง',
    text_2: 'ใช้งานได้หลายภาษา ไทย อังกฤษ จีน ญี่ปุ่น',
    text_3: 'มีเสียงให้เลือกใช้งาน หลากหลายช่วงวัย',
    text_4: 'สามารถบันทึกโปรเจค กลับมาทำภายหลังได้',
    text_5: 'ปรับระดับเสียง และ ความเร็วการอ่านได้',
    text_6: 'แก้ไขคำที่อ่านผิดได้ด้วยตัวเอง',
    text_7: 'รองรับการใช้งาน บนสมาร์ทโฟน',
    text_8: 'รองรับการใช้งาน ผู้พิการทางสายตา',
    text_9: 'มี API ให้นักพัฒนา นำไปใช้งาน',
  },
  bottom_banner: {
    header: 'ให้เราช่วยสร้างสรรค์ผลงานของคุณ',
    btn: 'สมัครใช้งานฟรี',
  },
  why_us: {
    header: 'ทำไมต้องเลือกเรา',
    header_list: 'AI Voiceover ที่ดีจะช่วยคุณ',
    sub_list_1: 'ช่วยให้คุณเป็นมืออาชีพมากขึ้น',
    sub_list_2: 'ช่วยให้คุณประหยัดเงินและเวลา',
    sub_list_3: 'ช่วยให้คุณมียอดไลค์ แชร์ และผู้ติดตามเพิ่ม',
    sub_list_4: 'ช่วยให้คุณมีอิสระในการทำงาน',
    text_list_1: 'ยกระดับผลงานของคุณให้ดูเป็นมืออาชีพ ทันสมัยและน่าสนใจมากขึ้น',
    text_list_2: 'ยกระดับผลงานของคุณให้ดูเป็นมืออาชีพ ทันสมัยและน่าสนใจมากขึ้น',
    text_list_3:
      'คุณจะสามารถสร้างเสียง Voiceover คุณภาพสูงได้ในราคาถูกและใช้เวลา ไม่นาน สะดวก ง่าย เข้าใจได้อย่างรวดเร็ว',
    text_list_4:
      'ทำให้ Content ของคุณน่าสนใจและดึงดูดผู้ชม รวมไปถึงคุณจะได้รับทั้ง จำนวนการดูและจำนวนผู้ติดตามเพิ่มขึ้นอีกด้วย',
  },
  review: 'รีวิวจากผู้ใช้งานจริง',
  contact: {
    header: 'ติดต่อเรา',
    name: 'ชื่อ-นามสกุล',
    company: 'ชื่อองค์กร',
    email: 'อีเมล',
    phone: 'เบอโทรศัพท์',
    detail: 'รายละเอียด',
    submit: 'ส่ง',
  },
};

const marketplaceV3 = {
  premium: {
    premium_tag: 'พรีเมียม',
    actor_tag: 'นักพากย์',
    profile: 'โปรไฟล์',
    contact: 'ติดต่อ',
    hero: {
      header: 'V',
      header_2: 'ICE OVER',
      sub_header: 'PREMIUM',
      detail: 'ศูนย์รวมนักพากย์คุณภาพ',
    },
    sample_picked: {
      header: 'คัดสรรมาให้คุณ',
      tabs: ['เสียงเพื่อโฆษณา', 'เสียงตัวละคร', 'เสียงบรรยาย'],
    },
    pros: {
      header: 'เสียงพากย์จริง',
      header_1: 'จากนักพากย์มืออาชีพ',
      detail: 'พบกับข้อดีของเสียงพากย์จริงที่จะเปลี่ยนแปลงการเล่าเรื่องของคุณ',
      list_item: [
        {
          header: 'เสียงมีชีวิตชีวา',
          detail: 'น้ำเสียงได้อย่างธรรมชาติและลึกซึ้ง',
        },
        {
          header: 'ปรับแต่งได้',
          detail: 'ปรับแต่งเสียงให้เข้ากับผลิตภัณฑ์ โฆษณา หรือสื่อต่างๆ',
        },
        {
          header: 'เข้าใจบริบท',
          detail: 'สามารถเข้าใจต่อบริบทของเรื่องราวได้ดี',
        },
        {
          header: 'สื่อความรู้สึก',
          detail: 'สามารถสื่อสารทางอารมณ์กับผู้ฟังได้ดี',
        },
        {
          header: 'เสียงหลากหลาย',
          detail:
            'ทำเสียงเลียนแบบได้หลายแบบตั้งแต่ตัวละครจนถึง ลักษณะพิเศษต่างๆ',
        },
      ],
    },
    step: {
      header: 'เริ่มต้นง่ายๆ..',
      sub_header: 'เพียงแค่ 3 ขั้นตอน',
      cards: [
        {
          card_header: 'เลือกเสียงพากย์',
          card_text: 'เลือกเสียงที่ชอบ',
          card_text_2: 'นักพากย์ที่ใช่',
        },
        {
          card_header: 'กรอกรายละเอียด',
          card_text: 'ส่งข้อมูลเกี่ยวกับงานที่ต้องการ และข้อมูลติดต่อ',
        },
        {
          card_header: 'รอรับการติดต่อ',
          card_text: 'บอทน้อยจะเป็นตัวกลางในการติดต่อระหว่างคุณและนักพากย์',
        },
      ],
    },
    btm_card: {
      header: 'นักพากย์ชื่อดัง',
      header_2: 'มอบเสียงที่เหมาะกับงานของคุณ',
    },
    profile_page: {
      main_page: 'หน้าหลัก',
      success_rate: 'อัตรางานสำเร็จ',
      edit_count: 'จำนวนครั้งที่แก้ได้',
      word_count: 'จำนวนคำ',
      work_duration: 'ระยะเวลาการทำงาน',
      initial_price: 'ราคาเริ่มต้น',
      ps_card: 'คุณจะยังไม่ถูกเรียกเก็บค่าใช้จ่ายใดๆ',
      contact: 'ติดต่อ',
      genre: 'แนวงานที่พากย์',
      language: 'ภาษาพากย์',
      sold: 'ขายได้',
      work_prefix: 'ผลงานของ',
      work_suffix: '',
      description: 'รายละเอียด',
      profile: 'โปรไฟล์',
      day: 'วัน',
      thb: 'บาท',
      times: 'ครั้ง',
      btm_card: {
        header: 'นักพากย์ชื่อดัง',
        header_2: 'มอบเสียงที่เหมาะกับงานของคุณ',
      },
    },
    dialog_contact: {
      header: 'รายละเอียดของงาน',
      language: 'ภาษาที่ต้องการ *',
      type: 'ประเภทของงาน *',
      duration: 'ความยาวเสียงที่ต้องการนำไปใช้ *',
      description: 'คำอธิบายงานหรือแนบลิ้งค์งาน *',
      upload: 'อัพโหลดไฟล์',
      date: 'ใช้งานเสียงภายในวันที่ *',
      addons: '*ส่วนเสริม',
      ot: 'จ่ายเพิ่มเพื่อรับงานเร็วขึ้น',
      ps: '*มีค่าใช้จ่ายเพิ่มเติม',
      header_2: 'ข้อมูลเบื้องต้น',
      name: 'ชื่อ-นามสกุล *',
      email: 'อีเมล *',
      phone: 'เบอร์โทรศัพท์ *',
      organization: 'ชื่อบริษัท (เฉพาะผู้ว่าจ้างที่ต้องการจ้างในนามบริษัท)',
      back: 'กลับ',
      cancel: 'ยกเลิก',
      confirm: 'ยืนยัน',
      next: 'ถัดไป',
      placeholder: {
        duration: '15 วินาที/1 นาที/10 นาที',
        job: 'ข้อมูลงาน',
        name: 'ชื่อ',
        surname: 'นามสกุล',
        email: 'อีเมล',
        phone: 'เบอร์โทรศัพท์',
        company: 'ชื่อบริษัท',
      },
    },
    dialog_profile: {
      profile: 'โปรไฟล์',
      voiceover: 'เสียงพากย์',
      ai_voice: 'เสียงเอไอ',
      prefered_style: 'งานพากย์เสียงที่ถนัด',
      contact: 'ติดต่อ',
      voice_sample: 'ตัวอย่างเสียงพากย์',
      ai_voice_sample: 'ตัวอย่างเสียงพากย์เอไอ',
      actor: 'นักพากย์',
    },
    edit_page: {
      main_page: 'หน้าหลัก',
    },
  },
  free: {
    free_tag: 'ฟรี',
    hero: {
      header: 'เสียงพากย์ AI',
      sub_header: 'มากกว่า 100 เสียง',
      detail:
        'บริการเสียงพากย์ AI ที่เป็นธรรมชาติมี ให้เลือกใช้งานมากกว่า 10 ภาษา',
    },
    marketplace: {
      filter: {
        lang: 'ภาษา',
        style: 'สไตล์',
        categories: 'หมวดหมู่',
        gender: 'เพศ/วัย',
        selectAll: 'เลือกทั้งหมด',
        clear: 'ล้าง',
        input_placeholder: 'ค้นหาเสียงที่คุณต้องการ',
      },
      result: {
        searchResult: 'ผลลัพธ์การค้นหา',
        resultAll: 'ทั้งหมด',
        resultList: 'รายการ',
        noResult: 'ไม่พบผลลัพธ์การค้นหา',
        try: 'ลองใช้คำค้นหาอื่น',
      },
      card: {
        addFav: 'รายการโปรด',
        removeFav: 'ลบ',
        freeVoice: 'เสียงฟรี',
        other: '+ อิ่นๆ',
        other_lang: 'ภาษาอื่นๆ ที่พูดได้',
      },
      tab: {
        free: 'เสียงฟรี',
        favorite: 'รายการโปรด',
      },
    },
    tooltip: {
      playSound: 'ฟังเสียง',
      useVoice: 'ใช้เสียงนี้',
      addFav: 'เพิ่มเป็นรายการโปรด',
      removeFav: 'ลบจากรายการโปรด',
      next: 'หน้าต่อไป',
      previous: 'ย้อนกลับ',
      filter: 'ค้นหาอย่างละเอียด',
    },
  },
};

const footerV2 = {
  studio: 'สตูดิโอ',
  voice: 'เลือกเสียงพากย์',
  dev: 'นักพัฒนา',
  price: 'ราคา',
  docs: 'คู่มือ',
  report: 'แจ้งปัญหา',
  contact: 'ช่องทางการติดต่อ',
  email: 'อีเมล: admin@botnoigroup.com',
  phone: 'โทรศัพท์: 064-192-2433',
  web: 'เว็บไซต์: www.botnoigroup.com',
  social: 'โซเชีลมีเดีย',
  toTop: 'กลับขึ้นข้างบน',
};

const removeVoice = {
  header: 'ลบกล่องเสียงที่เลือก',
  body: 'คุณยืนยันที่จะลบกล่องเสียงที่เลือกนี้ใช่หรือไม่',
  checkbox: 'ไม่ต้องแสดงอีก',
  btnCancel: 'ยกเลิก',
  btnConfirm: 'ตกลง',
};

const dialogAds = {
  header: ['เสียงที่สร้างจะเล่นต่อ', 'หลังจากจบโฆษณา'],
  play: 'โฆษณา',
  url: 'ไปที่เว็บไซต์',
  ads: ['พิเศษ! สมัครสมาชิกเพียง ', ' บาท ใช้งานแบบไม่มีโฆษณากวนใจ'],
  apply: 'สมัครเลย',
  free: 'ฟรี',
  premium: 'พรีเมี่ยม',
  voice_front: 'เสียง',
};

const dialogResetsubscription = {
  header: 'แจ้งเตือน',
  sub_header:
    'เนื่องจากทางเว็บไซต์ Botnoi Voice ได้ทำการยกเลิกระบบจำกัดโควตาการสร้างเสียงและยกเลิกระบบการสมัครแพ็คเกจรายเดือนและรายปีตามคำเรียกร้องของผู้ใช้โดยเปลี่ยนมาเป็นระบบซื้อพอยท์ซึ่งมีความคุ้มค่ากว่าและเหมาะสมสำหรับการใช้งาน',
  sub_header_199:
    'เนื่องจากทางเว็บไซต์ Botnoi Voice ได้ทำการเริ่มใช้งานระบบ Member: No ads สำหรับลูกค้าที่เคยมีประวัติการซื้อ points ตั้งแต่โปรโมชั่น 199 บาทขึ้นไป ตั้งแต่วันที่ 20/11/2023 ทางทีม Botnoi Voice ขอแจ้งให้ทราบว่าเราได้ทำการมอบสิทธิพิเศษให้ท่านดังนี้',
  body_yearly:
    'สำหรับลูกค้าที่สมัครแพ็คเกจรายปีและมีสถานะ active ทางทีม Botnoi Voice ขอแจ้งให้ทราบว่าเราได้ทำการชดเชยการเปลี่ยนแปลงให้ท่านดังนี้ :',
  body_monthly:
    'สำหรับลูกค้าที่สมัครแพ็คเกจรายเดือนและมีสถานะ active ทางทีม Botnoi Voice ขอแจ้งให้ทราบว่าเราได้ทำการชดเชยการเปลี่ยนแปลงให้ท่านดังนี้ :',
  body_compensate:
    'สำหรับลูกค้าที่ที่เป็น compensated account และมีสถานะ active ทางทีม Botnoi Voice ขอแจ้งให้ทราบว่าเราได้ทำการชดเชยการเปลี่ยนแปลงให้ท่านดังนี้ :',
  compensate_list: [
    {
      text_1: 'ชดเชย points ',
      text_2: ' เดือน ให้ ',
      text_3: ' account ของท่าน',
      text_4: ' พ้อยท์ (มูลค่าเทียบเท่า ',
      text_5: ' บาท)',
    },
    {
      text_1: 'เพิ่มสถานะ member: No ads ไม่มีโฆษณารบกวนให้ท่านเป็นเวลา ',
      text_2: ' เดือน',
    },
    "และท่านยังสามารถกรอกรหัส 'botnoivip' ได้ในการซื้อ points ทุกครั้ง โดยการใช้รหัสนี้จะทำให้ท่านได้รับ points เพิ่มขึ้น 20% ทุกๆครั้งที่ซื้อ โดยรหัสนี้มีอายุการใช้งานถึง 31/01/2024",
    'เพิ่มสถานะ member: No ads ไม่มีโฆษณารบกวนให้ท่านจนถึงวันที่ 31/01/2024',
  ],

  btn: 'รับชดเชย',
  footer: '',
};
const historyPage = {
  title: 'ประวัติการชำระเงิน',
  date: 'วัน/เดือน/ปี',
  table: ['รายละเอียด', 'แท็ก', 'พ้อยท์', '', 'เวลา'],
  tag: ['รับพ้อยท์', 'ใช้พ้อยท์'],
  item: 'จำนวนที่แสดง: ',
};

const mediaCenter = {
  header: ['ผู้ใช้งาน', 'Botnoi Voice', 'ที่เราแนะนำ'],
  sub_text: 'ช่องคอนเทนต์',
  sub_text2: 'วีดีโอคอนเทนต์',
  subscribe: 'ผู้ติดตาม ',
  btn_follow: 'ติดตาม',
};

const subscription_management = {
  no_package: 'ตอนนี้คุณยังไม่มีแพคเกจเสริม',
  promotion: 'ดูโปรโมชั่นส่วนลดสุดคุ้มอื่นๆ',
  click: 'คลิก',
};

const seo_page = {
  dialog: {
    header: 'คุณเหลือการดาวน์โหลดฟรี 1 ครั้งต่อวัน',
    headerFull: 'คุณถึงขีดจำกัดการดาวน์โหลดฟรีต่อวันแล้ว',
    genFull: 'คุณถึงขีดจำกัดการสร้างเสียงฟรีต่อวันแล้ว',
    details_colored: 'รับฟรี 100 พ้อยต์',
    details: 'สำหรับผู้ใช้ใหม่',
    confirm: 'ใช้เวอร์ชั่นเต็ม',
  },
  faq_list: [
    {
      title: 'What is text to speech (TTS)?',
      description:
        'Botnoi Voice is the simplest way to convert text into speech. Simply type the text to be spoken or read aloud, and then select your voiceover from the available languages or categories. After customization and generation, it is now available for download and sharing.',
    },
    {
      title: 'How to convert text to speech?',
      description:
        'Botnoi Voice is the simplest way to convert text into speech. Simply type the text to be spoken or read aloud, and then select your voiceover from the available languages or categories. After customization and generation, it is now available for download and sharing.',
    },
    {
      title: 'Do I have to subscribe to a monthly plan?',
      description:
        'Botnoi Voice is the simplest way to convert text into speech. Simply type the text to be spoken or read aloud, and then select your voiceover from the available languages or categories. After customization and generation, it is now available for download and sharing.',
    },
    {
      title: 'Do you have an API for Developer?',
      description:
        'Botnoi Voice is the simplest way to convert text into speech. Simply type the text to be spoken or read aloud, and then select your voiceover from the available languages or categories. After customization and generation, it is now available for download and sharing.',
    },
    {
      title: 'Can I try out Botnoi Voice before making a payment?',
      description:
        'Botnoi Voice is the simplest way to convert text into speech. Simply type the text to be spoken or read aloud, and then select your voiceover from the available languages or categories. After customization and generation, it is now available for download and sharing.',
    },
  ],
};

const genSoundStandalone = {
  try: 'ทดลองใช้ฟรี',
  credit: 'เครดิตโหลดฟรี:',
  credit_subfix: 'ครั้ง / วัน',
  upgrade: 'ใช้เวอร์ชั่นเต็มเพื่อดาวน์โหลดเพิ่ม',
  generate: 'สร้าง',
  download: 'ดาวน์โหลด',
  no_credit: 'เครดิตของคุณหมดแล้ว ใช้เวอร์ชั่นเต็มเพื่อดาวน์โหลดเพิ่ม',
  full_version: 'ใช้เวอร์ชั่นเต็ม',
  clearText: 'ลบทั้งหมด',
  play: 'เล่นเสียง',
  pause: 'หยุดเสียง',
  alertSelect: 'กรุณาเลือกภาษาก่อน',
  placeholderDefault: 'ลองพิมพ์ประโยคที่คุณต้องการที่นี้',
  dialog: {
    headerLogin: 'กรุณาเข้าสู่ระบบเพื่อทำการดาวน์โหลด',
    header: 'ดาวน์โหลดสำเร็จ',
    credit: 'คุณมีเครดิตเหลือ :',
    details_colored: 'รับฟรี 100 พ้อยต์ ',
    details: 'สำหรับผู้ใช้ใหม่',
    confirm: 'ใช้เวอร์ชั่นเต็ม',
    confirm_login: 'เข้าสู่ระบบ',
  },
};

const survey = {
  careerArray: [
    {
      id: 1,
      title: 'ผลิตคอนเทนต์',
      value: 'Content creator',
      desc1: 'ทำคลิป Tiktok',
      desc2: 'อ่านหนังสือ ข่าว พอดแคส',
      img: '../../../../assets/images/survey/display-pic-1.png',
    },
    {
      id: 2,
      title: 'งานเพื่อการศึกษา',
      value: 'Educational',
      desc1: 'ทำสไลด์พรีเซ้นท์',
      desc2: 'ทำโปรเจกต์',
      img: '../../../../assets/images/survey/display-pic-2.png',
    },
    {
      id: 3,
      title: 'Agency /Outsource',
      value: 'Agency /Outsource',
      desc1: 'พรีเซ้นท์งาน',
      desc2: 'อบรมองค์กร',
      img: '../../../../assets/images/survey/display-pic-3.png',
    },
    {
      id: 4,
      title: 'ธุรกิจส่วนตัว',
      value: 'SMEs business',
      desc1: 'งาน SMEs',
      desc2: 'บริษัทขนาด 3-15 คน',
      img: '../../../../assets/images/survey/display-pic-4.png',
    },
    {
      id: 5,
      title: 'งานในองค์กร',
      value: 'Enterprises',
      desc1: 'ใช้ทำงานสำหรับ',
      desc2: 'บริษัทและองค์กรขนาดใหญ่',
      img: '../../../../assets/images/survey/display-pic-5.png',
    },
    {
      id: 6,
      title: 'อื่นๆ',
      value: 'Others',
      desc1: 'ทดลองใช้งาน',
      desc2: 'หรือไม่มีอยู่ในตัวเลือก',
      img: '../../../../assets/images/survey/display-pic-6.png',
    },
  ],
  careerChoice: [
    {
      id: 1,
      choice: [
        {
          id: 1,
          name: 'คอนเทนต์ตลก/มีม/เกมส์',
          value: 'Funny contents/Games',
        },
        {
          id: 2,
          name: 'อ่านนิทาน/เล่าเรื่อง/หนังสือเสียง',
          value: 'Audio books/Kids story video',
        },
        {
          id: 3,
          name: 'อ่านข่าว/สาระความรู้',
          value: 'News/Nonfiction/Documentary',
        },
        {
          id: 4,
          name: 'vlogger',
          value: 'Vlogger',
        },
        {
          id: 5,
          name: 'พอดแคส/ไลฟ์โค้ช',
          value: 'Podcast/Life coach',
        },
        {
          id: 6,
          name: 'อื่น ๆ',
          value: 'etc.',
        },
      ],
    },
    {
      id: 2,
      choice: [
        {
          id: 1,
          name: 'นักเรียน',
          value: 'Student',
        },
        {
          id: 2,
          name: 'นักศึกษา',
          value: 'University student',
        },
        {
          id: 3,
          name: 'โค้ช วิทยากรพิเศษ',
          value: 'Coach/Expert/Lecturer',
        },
        {
          id: 4,
          name: 'ครู อาจารย์',
          value: 'Teacher/Professor',
        },
        {
          id: 5,
          name: 'รัฐวิสาหกิจ',
          value: 'State enterprise',
        },
        {
          id: 6,
          name: 'อื่น ๆ',
          value: 'etc.',
        },
      ],
    },
    {
      id: 3,
      choice: [
        {
          id: 1,
          name: 'การตลาด โฆษณา',
          value: 'Marketing/Ads',
        },
        {
          id: 2,
          name: 'งานด้านการศึกษา',
          value: 'Education consult',
        },
        {
          id: 3,
          name: 'งานบริการลูกค้า',
          value: 'Customer service',
        },
        {
          id: 4,
          name: 'คลิปคอนเทนต์ สาระความรู้',
          value: 'Explainer video',
        },
        {
          id: 5,
          name: 'งานอบรมองค์กร',
          value: 'Corporate training',
        },
        {
          id: 6,
          name: 'อื่น ๆ',
          value: 'etc.',
        },
      ],
    },
    {
      id: 4,
      choice: [
        {
          id: 1,
          name: 'การตลาด',
          value: 'Marketing',
        },
        {
          id: 2,
          name: 'ฝ่ายขาย',
          value: 'Sale',
        },
        {
          id: 3,
          name: 'บริการลูกค้า',
          value: 'Customer service',
        },
        {
          id: 4,
          name: 'ผลิตสินค้า',
          value: 'Product',
        },
        {
          id: 5,
          name: 'อื่น ๆ',
          value: 'etc.',
        },
      ],
    },
    {
      id: 5,
      choice: [
        {
          id: 1,
          name: 'การตลาด/ฝ่ายขาย',
          value: 'Marketing/Sales',
        },
        {
          id: 2,
          name: 'Product/IT/ออกแบบ',
          value: 'Product/IT/Design',
        },
        {
          id: 3,
          name: 'HR',
          value: 'HR',
        },
        {
          id: 4,
          name: 'บริการลูกค้า',
          value: 'Customer service',
        },
        {
          id: 5,
          name: 'ผู้บริหาร',
          value: 'CEO/manager',
        },
        {
          id: 6,
          name: 'อื่น ๆ',
          value: 'etc.',
        },
      ],
    },
    {
      id: 6,
      choice: [{ id: 1, name: 'none', value: 'none' }],
    },
  ],
  age: [
    { age: 'ต่ำกว่า 20', value: '<20' },
    { age: '20-29', value: '20-29' },
    { age: '30-39', value: '30-39' },
    { age: '40-49', value: '40-49' },
    { age: '50 ขึ้นไป', value: '>50' },
  ],
  surveyhead: 'ทำแบบสอบถามไม่ถึง 1 นาที ',
  surveyhead2: 'รับฟรี 1200 พ้อยท์',
  youremail: 'อีเมลของคุณ',
  yourage: 'อายุของคุณ',
  yourcountry: 'คุณมาจากประเทศอะไร',
  nearly: 'ใกล้จะเสร็จแล้ว...',
  usefor: 'คุณใช้ Botnoi voice สำหรับ...',
  youdo: 'คุณทำ...',
  ready: 'พร้อมใช้งานแล้ว!',
  inputemail: 'ใส่ที่อยู่อีเมล',
  inputother: 'คุณใช้ Botnoi voice ทำ...',
  next: 'ไปต่อ',
  finish: 'เสร็จสิ้น',
  thanks1: 'คุณได้รับ 1,200 PT ',
  thanks2: 'ขอบคุณสำหรับการตอบคำถาม',
  close: 'อีกนิดเดียวจะได้ 1,200 PT แล้ว ',
  close2: 'ต้องการออกจากแบบสอบถามหรือไม่',
  dontshow: 'ไม่ต้องเตือนฉันอีก',
  leave: 'ออกจากหน้านี้',
  back: 'กลับไปทำต่อ',
  back2: 'ย้อนกลับ',
  selectcountry: 'เลือกประเทศ',
  countries: [
    { code: 'Thailand', name: 'ไทย' },
    { code: 'United Kingdom', name: 'อังกฤษ' },
    { code: 'Indonesia', name: 'อินโดนีเซีย' },
    { code: 'Japan', name: 'ญี่ปุ่น' },
    { code: 'Laos', name: 'ลาว' },
    { code: 'Myanmar', name: 'เมียนมาร์' },
    { code: 'Vietnam', name: 'เวียดนาม' },
    { code: 'China', name: 'จีน' },
    { code: 'United States', name: 'สหรัฐอเมริกา' },
    { code: 'Cambodia', name: 'กัมพูชา' },
    { code: 'Malaysia', name: 'มาเลเซีย' },
    { code: 'Singapore', name: 'สิงคโปร์' },
    { code: 'Brunei Darussalam', name: 'บรูไน' },
    { code: 'Philippines', name: 'ฟิลิปปินส์' },
    { code: 'Afghanistan', name: 'อัฟกานิสถาน' },
    { code: 'Albania', name: 'แอลเบเนีย' },
    { code: 'Algeria', name: 'แอลจีเรีย' },
    { code: 'Andorra', name: 'อันดอร์รา' },
    { code: 'Angola', name: 'แองโกลา' },
    { code: 'Antigua And Barbuda', name: 'แอนติกาและบาร์บูดา' },
    { code: 'Argentina', name: 'อาร์เจนตินา' },
    { code: 'Armenia', name: 'อาร์เมเนีย' },
    { code: 'Aruba', name: 'อารูบา' },
    { code: 'Australia', name: 'ออสเตรเลีย' },
    { code: 'Austria', name: 'ออสเตรีย' },
    { code: 'Azerbaijan', name: 'อาเซอร์ไบจาน' },
    { code: 'Bahamas', name: 'บาฮามาส' },
    { code: 'Bahrain', name: 'บาห์เรน' },
    { code: 'Bangladesh', name: 'บังกลาเทศ' },
    { code: 'Barbados', name: 'บาร์เบโดส' },
    { code: 'Belarus', name: 'เบลารุส' },
    { code: 'Belgium', name: 'เบลเยียม' },
    { code: 'Belize', name: 'เบลีซ' },
    { code: 'Benin', name: 'เบนิน' },
    { code: 'Bhutan', name: 'ภูฏาน' },
    { code: 'Bolivia', name: 'โบลิเวีย' },
    { code: 'Bosnia', name: 'บอสเนีย' },
    { code: 'Botswana', name: 'บอตสวานา' },
    { code: 'Brazil', name: 'บราซิล' },
    { code: 'Bulgaria', name: 'บัลแกเรีย' },
    { code: 'Burkina Faso', name: 'บูร์กินาฟาโซ' },
    { code: 'Burundi', name: 'บุรุนดี' },
    { code: 'Cameroon', name: 'แคเมอรูน' },
    { code: 'Canada', name: 'แคนาดา' },
    { code: 'Cape Verde', name: 'เคปเวิร์ด' },
    { code: 'Central African Republic', name: 'สาธารณรัฐแอฟริกากลาง' },
    { code: 'Chad', name: 'ชาด' },
    { code: 'Chile', name: 'ชิลี' },
    { code: 'Colombia', name: 'โคลอมเบีย' },
    { code: 'Comoros', name: 'คอโมโรส' },
    { code: 'Congo', name: 'คองโก' },
    { code: 'Costa Rica', name: 'คอสตาริกา' },
    { code: "Cote D'Ivoire", name: 'ไอวอรีโคสต์' },
    { code: 'Croatia', name: 'โครเอเชีย' },
    { code: 'Cuba', name: 'คิวบา' },
    { code: 'Cyprus', name: 'ไซปรัส' },
    { code: 'Czech Republic', name: 'สาธารณรัฐเช็ก' },
    { code: 'Denmark', name: 'เดนมาร์ก' },
    { code: 'Djibouti', name: 'จิบูตี' },
    { code: 'Dominica', name: 'โดมินิกา' },
    { code: 'Dominican Republic', name: 'สาธารณรัฐโดมินิกัน' },
    { code: 'Ecuador', name: 'เอกวาดอร์' },
    { code: 'Egypt', name: 'อียิปต์' },
    { code: 'El Salvador', name: 'เอลซัลวาดอร์' },
    { code: 'Equatorial Guinea', name: 'กินีอิเควทอเรียล' },
    { code: 'Eritrea', name: 'เอริเทรีย' },
    { code: 'Estonia', name: 'เอสโตเนีย' },
    { code: 'Ethiopia', name: 'เอธิโอเปีย' },
    { code: 'Fiji', name: 'ฟีจี' },
    { code: 'Finland', name: 'ฟินแลนด์' },
    { code: 'France', name: 'ฝรั่งเศส' },
    { code: 'Gabon', name: 'กาบอง' },
    { code: 'Gambia', name: 'แกมเบีย' },
    { code: 'Georgia', name: 'จอร์เจีย' },
    { code: 'Germany', name: 'เยอรมนี' },
    { code: 'Ghana', name: 'กานา' },
    { code: 'Greece', name: 'กรีซ' },
    { code: 'Greenland', name: 'กรีนแลนด์' },
    { code: 'Grenada', name: 'เกรเนดา' },
    { code: 'Guam', name: 'กวม' },
    { code: 'Guatemala', name: 'กัวเตมาลา' },
    { code: 'Guinea', name: 'กินี' },
    { code: 'Guinea-Bissau', name: 'กินี-บิสเซา' },
    { code: 'Guyana', name: 'กายอานา' },
    { code: 'Haiti', name: 'เฮติ' },
    {
      code: 'Holy See (Vatican City State)',
      name: 'สำนักสูงสุดแห่งศาสนา (นครวาติกัน)',
    },
    { code: 'Honduras', name: 'ฮอนดูรัส' },
    { code: 'Hungary', name: 'ฮังการี' },
    { code: 'Iceland', name: 'ไอซ์แลนด์' },
    { code: 'India', name: 'อินเดีย' },
    { code: 'Iran', name: 'อิหร่าน' },
    { code: 'Iraq', name: 'อิรัก' },
    { code: 'Ireland', name: 'ไอร์แลนด์' },
    { code: 'Israel', name: 'อิสราเอล' },
    { code: 'Italy', name: 'อิตาลี' },
    { code: 'Jamaica', name: 'จาเมกา' },
    { code: 'Jordan', name: 'จอร์แดน' },
    { code: 'Kazakhstan', name: 'คาซัคสถาน' },
    { code: 'Kenya', name: 'เคนยา' },
    { code: 'Kiribati', name: 'คิริบาส' },
    { code: 'South Korea', name: 'เกาหลีใต้' },
    { code: 'North Korea', name: 'เกาหลีเหนือ' },
    { code: 'Kuwait', name: 'คูเวต' },
    { code: 'Kyrgyzstan', name: 'คีร์กีซสถาน' },
    { code: 'Latvia', name: 'ลัตเวีย' },
    { code: 'Lebanon', name: 'เลบานอน' },
    { code: 'Lesotho', name: 'เลโซโท' },
    { code: 'Liberia', name: 'ไลบีเรีย' },
    { code: 'Libyan', name: 'ลิเบีย' },
    { code: 'Liechtenstein', name: 'ลิกเตนสไตน์' },
    { code: 'Lithuania', name: 'ลิทัวเนีย' },
    { code: 'Luxembourg', name: 'ลักเซมเบิร์ก' },
    { code: 'Macedonia', name: 'มาซิโดเนีย' },
    { code: 'Madagascar', name: 'มาดากัสการ์' },
    { code: 'Malawi', name: 'มาลาวี' },
    { code: 'Maldives', name: 'มัลดีฟส์' },
    { code: 'Mali', name: 'มาลี' },
    { code: 'Malta', name: 'มอลตา' },
    { code: 'Mauritania', name: 'โมริเตเนีย' },
    { code: 'Mauritius', name: 'มอริเชียส์' },
    { code: 'Mexico', name: 'เม็กซิโก' },
    { code: 'Micronesia', name: 'ไมโครนีเซีย' },
    { code: 'Moldova', name: 'มอลโดวา' },
    { code: 'Monaco', name: 'โมนาโก' },
    { code: 'Mongolia', name: 'มองโกเลีย' },
    { code: 'Montenegro', name: 'มอนเตเนโกร' },
    { code: 'Montserrat', name: 'มอนต์เซอร์รัต' },
    { code: 'Morocco', name: 'โมร็อกโก' },
    { code: 'Mozambique', name: 'โมซัมบิก' },
    { code: 'Namibia', name: 'นามิเบีย' },
    { code: 'Nauru', name: 'นาอูรู' },
    { code: 'Nepal', name: 'เนปาล' },
    { code: 'Netherlands', name: 'เนเธอร์แลนด์' },
    { code: 'New Zealand', name: 'นิวซีแลนด์' },
    { code: 'Nicaragua', name: 'นิการากัว' },
    { code: 'Niger', name: 'ไนเจอร์' },
    { code: 'Nigeria', name: 'ไนจีเรีย' },
    { code: 'Norway', name: 'นอร์เวย์' },
    { code: 'Oman', name: 'โอมาน' },
    { code: 'Pakistan', name: 'ปากีสถาน' },
    { code: 'Palau', name: 'ปาเลา' },
    { code: 'Palestine', name: 'ปาเลสไตน์' },
    { code: 'Panama', name: 'ปานามา' },
    { code: 'Papua New Guinea', name: 'ปาปัวนิวกินี' },
    { code: 'Paraguay', name: 'ปารากวัย' },
    { code: 'Peru', name: 'เปรู' },
    { code: 'Poland', name: 'โปแลนด์' },
    { code: 'Portugal', name: 'โปรตุเกส' },
    { code: 'Qatar', name: 'กาตาร์' },
    { code: 'Romania', name: 'โรมาเนีย' },
    { code: 'Russia', name: 'รัสเซีย' },
    { code: 'Rwanda', name: 'รวันดา' },
    { code: 'Samoa', name: 'ซามัว' },
    { code: 'San Marino', name: 'ซานมารีโน' },
    { code: 'Sao Tome And Principe', name: 'เซาตูเมและปรินซิปี' },
    { code: 'Saudi Arabia', name: 'ซาอุดีอาระเบีย' },
    { code: 'Senegal', name: 'เซเนกัล' },
    { code: 'Serbia', name: 'เซอร์เบีย' },
    { code: 'Seychelles', name: 'เซเชลส์' },
    { code: 'Sierra Leone', name: 'เซียร์ราลีโอน' },
    { code: 'Slovakia', name: 'สโลวะเกีย' },
    { code: 'Slovenia', name: 'สโลวีเนีย' },
    { code: 'Somalia', name: 'โซมาเลีย' },
    { code: 'South Africa', name: 'แอฟริกาใต้' },
    { code: 'Spain', name: 'สเปน' },
    { code: 'Sri Lanka', name: 'ศรีลังกา' },
    { code: 'Sudan', name: 'ซูดาน' },
    { code: 'Suriname', name: 'ซูรินาเม' },
    { code: 'Swaziland', name: 'สวาซิแลนด์' },
    { code: 'Sweden', name: 'สวีเดน' },
    { code: 'Switzerland', name: 'สวิตเซอร์แลนด์' },
    { code: 'Syrian', name: 'ซีเรีย' },
    { code: 'Taiwan', name: 'ไต้หวัน' },
    { code: 'Tajikistan', name: 'ทาจิกิสถาน' },
    { code: 'Tanzania', name: 'แทนซาเนีย' },
    { code: 'Timor-Leste', name: 'ติมอร์-เลสเต' },
    { code: 'Togo', name: 'โตโก' },
    { code: 'Tonga', name: 'ตองกา' },
    { code: 'Trinidad And Tobago', name: 'ตรินิแดดและโตเบโก' },
    { code: 'Tunisia', name: 'ตูนิเซีย' },
    { code: 'Turkey', name: 'ตุรกี' },
    { code: 'Turkmenistan', name: 'เติร์กเมนิสถาน' },
    { code: 'Tuvalu', name: 'ตูวาลู' },
    { code: 'Uganda', name: 'ยูกันดา' },
    { code: 'Ukraine', name: 'ยูเครน' },
    { code: 'United Arab Emirates', name: 'สหรัฐอาหรับเอมิเรตส์' },
    { code: 'Uruguay', name: 'อุรุกวัย' },
    { code: 'Uzbekistan', name: 'อุซเบกิสถาน' },
    { code: 'Vanuatu', name: 'วานูอาตู' },
    { code: 'Venezuela', name: 'เวเนซุเอลา' },
    { code: 'Yemen', name: 'เยเมน' },
    { code: 'Zambia', name: 'แซมเบีย' },
    { code: 'Zimbabwe', name: 'ซิมบับเว' },
  ],
};
const enterprise = {
  header: {
    head1: 'ใช้ไม่อั้นสำหรับบริษัท',
    head2: 'ยิ่งใช้งานเป็นทีม ยิ่งถูกลง!',
  },
  type: {
    month: 'Monthly',
    year: 'Yearly',
  },
  perk: {
    titleperk1: 'ดาวน์โหลดไม่อั้น',
    titleperk2: 'ไม่มีโฆษณา',
    perk1: 'ไม่ต้องกังวลพ้อยท์หมด',
    perk2: 'ให้กังวลใจ',
  },
  contact: 'ติดต่อ',
  yeartag: 'รายปีถูกกว่า',
  toggle: {
    monthbutton: 'รายเดือน',
    yearbutton: 'รายปี',
    free2month: 'ฟรี2เดือน',
  },
};

const errorMessageMapping: TErrorMessageMapping = {
  signIn: {
    'auth/user-not-found': 'อีเมลไม่ถูกต้อง',
    'auth/wrong-password': 'รหัสผ่านไม่ถูกต้อง',
  },
  signUp: {
    'auth/email-already-in-use': 'อีเมลนี้ถูกใช้ไปแล้ว',
    'auth/invalid-email': 'อีเมลไม่ถูกต้อง',
    'auth/weak-password': 'รหัสผ่านต้องมีมากกว่า 6 ตัวอักษร',
    'own/passwords-not-match': 'รหัสผ่านไม่ตรงกัน',
  },
  forgotPassword: {},
  share: {
    required: 'กรุณากรอกข้อมูล',
  },
};
const studioMobileFirst = {
  bottomNav: {
    save_success: 'บันทึกโปรเจคสำเร็จ',
    download_alert: 'กรุณาสร้างเสียงก่อนดาวน์โหลด',
    edit_word: 'แก้ไขเสียงอ่าน',
    play_all: 'เล่นทั้งหมด',
    download: 'ดาวน์โหลด',
    save: 'บันทึก',
  },
  box: {
    generate: 'สร้าง',
    download: 'ดาวน์โหลด',
    lang_des: '(กรุณาตั้งค่าภาษาให้ตรงกับที่พิมพ์)',
    select_des: '(กรุณาเลือกเสียง)',
    select_voice: 'เลือกเสียงพากย์',
    mainLang: 'ภาษาหลัก',
    addonsLang: 'ภาษาเพิ่มเติม',
    alert_exceed: 'จำนวนตัวอักษรเกินกว่ากำหนด',
    snackbar: [
      {
        sound_success: 'สร้างเสียงสำเร็จ',
        sound_error: 'สร้างเสียงไม่สำเร็จ',
      },
    ],
    drag: {
      top: 'เลื่อนขึ้นข้างบนสุด',
      up: 'เลื่อนขึ้นข้างบน',
      down: 'เลื่อนลงข้างล่าง',
      bot: 'เลื่อนลงข้างล่างสุด',
    },
    options: {
      switch: 'สลับตำแหน่ง',
      add_above: 'แทรกเสียงข้างบน',
      add_below: 'แทรกเสียงข้างล่าง',
    },
  },
};

export const TH = {
  PersonalForm: PersonalForm,
  navbarObj: Navbar[0],
  landingPageObj: LandingPage[0],
  text2speechObj: text2speech[0],
  feedbackFromObj: feedback_form[0],
  wordStoreObj: word_store[0],
  audioStorageObj: audio_storage[0],
  walletObj: wallet[0],
  marketplaceObj: marketplace[0],
  apitutorialObj: api_tutorial[0],
  shareObj: share[0],
  addcartAlertObj: addcart_alert[0],
  dialogObj: dialog[0],
  audioPlanObj: audioPlan[0],
  bottomMenuObj: bottomMenu[0],
  dialogconfirmObj: dialogconfirm[0],
  addworddialogObj: addworddialog[0],
  audioDownloadObj: audio_download[0],
  salesObj: sales,
  authServiceObj: _auth,
  dialogMessageObj: dialogMessageObj,
  dialogServiceObj: dialogService,
  firebaseAuthObj: firebaseAuth,
  campaignObj: campaign,
  soundTestObj: soundTest,
  popupObj: popupObj,
  agreementObj: agreement,
  blacklistObj: blacklist,
  longwordObj: longword,
  audioObj: audio,
  storageObj: storage,
  workspaceObj: workspace,
  subscriptionObj: subscription,
  importexportObj: importexport,
  leavePageObj: leaveAlert,
  userObj: userObj,
  newsObj: newsObj,
  historyAlertObj: historyAlert,
  quoteObj: quoteObj,
  selectVoiceObj: selectVoiceDialog,
  patchNoteObj: patchNoteObj,
  dialogPaid: dialogPaid,
  marketplace_v2_Obj: marketplace_v2_Obj,
  report: report,
  quotaDialogObj: quotaDialog,
  maintenance: maintenance,
  upsell,
  landingPageV3Obj: landingPageV3,
  marketplaceV3Obj: marketplaceV3,
  footerV2Obj: footerV2,
  removeVoiceObj: removeVoice,
  dialogAds,
  dialogResetsubscription,
  historyPageObj: historyPage,
  mediaCenter,
  subscriptionManagementObj: subscription_management,
  seoPageObj: seo_page,
  surveyObj: survey,
  genSoundStandalone: genSoundStandalone,
  promotionEnterpriseObj: enterprise,
  errorMessageMapping,
  studioMobileFirstObj: studioMobileFirst,
};
